STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.c
  By default, after the HAL_ADF_Init() and when the state is @ref HAL_ADF_STATE_INIT, all callbacks are set to the
  corresponding default weak functions.

  Callbacks can be registered in all states.

  When the compilation define USE_HAL_ADF_REGISTER_CALLBACKS is set to 0 or not defined, the callback registration
  feature is not available and weak callbacks are used, represented by the default value in the table above.

### Configuration inside the HAL ADF driver:

Config defines                 | Where            | Default value     | Note
-------------------------------| -----------------| ------------------| -------------------------------------------
USE_HAL_ADF_MODULE             | hal_conf.h       |         1         | Enable the HAL ADF module
USE_HAL_ADF_REGISTER_CALLBACKS | hal_conf.h       |         0         | Allow user to define his own callback
USE_HAL_ADF_CLK_ENABLE_MODEL   | hal_conf.h       | HAL_CLK_ENABLE_NO | Enable the gating of the peripheral clock
USE_HAL_ADF_USER_DATA          | hal_conf.h       |         0         | Add an user data inside HAL ADF handle
USE_HAL_ADF_GET_LAST_ERRORS    | hal_conf.h       |         0         | Enable retrieving last processes error codes
USE_HAL_ADF_DMA                | hal_conf.h       |         1         | Enable DMA code inside HAL ADF
USE_HAL_CHECK_PARAM            | hal_conf.h       |         0         | Enable checking of vital parameters at runtime
USE_HAL_CHECK_PROCESS_STATE    | hal_conf.h       |         0         | Enable atomic access to process state check
USE_ASSERT_DBG_PARAM           | PreProcessor env |        NONE       | Enable check parameters for HAL
USE_ASSERT_DBG_STATE           | PreProcessor env |        NONE       | Enable check state for HAL
  */

#if defined(USE_HAL_ADF_MODULE) && (USE_HAL_ADF_MODULE == 1)

/* Private macros ------------------------------------------------------------*/
/** @defgroup ADF_Private_Macros ADF Private Macros
  * @{
  */

/**
  * @brief Get ADF instance from the selected HAL ADF handle
  */
#define ADF_GET_INSTANCE(hadf) ((ADF_TypeDef *)((uint32_t)(hadf)->instance))

/**
  * @brief Get ADF block from the selected HAL ADF handle and index
  */
#define ADF_GET_BLOCK(hadf, index) ((ADF_Block_TypeDef *)(((uint32_t)(hadf)->instance) \
                                                          + (ADF1_BLOCK_SIZE * ((uint32_t)(index) + 1U))))

/**
  * @brief Processing clock divider
  */
#define IS_ADF_PROC_CLOCK_DIVIDER(value) ((1U <= (value)) && ((value) <= 128U))

/**
  * @brief Output clock pins
  */
#define IS_ADF_OUTPUT_CLOCK_PINS(pins) (((pins) == HAL_ADF_OUTPUT_CLOCK_NONE) \
                                        || ((pins) == HAL_ADF_OUTPUT_CLOCK_CCK0) \
                                        || ((pins) == HAL_ADF_OUTPUT_CLOCK_CCK1) \
                                        || ((pins) == HAL_ADF_OUTPUT_CLOCK_ALL))

/**
  * @brief Output clock divider
  */
#define IS_ADF_OUTPUT_CLOCK_DIVIDER(value) ((1U <= (value)) && ((value) <= 16U))

/**
  * @brief Output clock trigger source
  */
#define IS_ADF_OUTPUT_CLOCK_TRIGGER_SOURCE(source) (((source) == HAL_ADF_OUT_CLOCK_TRIG_TRGO) \
                                                    || ((source) == HAL_ADF_OUT_CLOCK_TRIG_EXTI15))

/**
  * @brief Output clock trigger edge
  */
#define IS_ADF_OUTPUT_CLOCK_TRIGGER_EDGE(edge) (((edge) == HAL_ADF_OUT_CLOCK_TRIG_RISING_EDGE) \
                                                || ((edge) == HAL_ADF_OUT_CLOCK_TRIG_FALLING_EDGE))

/**
  * @brief Block index
  */
#define IS_ADF_BLOCK_INDEX(value) ((value) <= (ADF1_BLOCKS_NUMBER - 1U))

/**
  * @brief Serial interface mode
  */
#define IS_ADF_SITF_MODE(mode) (((mode) == HAL_ADF_SITF_MODE_LF_MASTER_SPI) \
                                || ((mode) == HAL_ADF_SITF_MODE_NORMAL_SPI) \
                                || ((mode) == HAL_ADF_SITF_MODE_MANCHESTER_FALLING) \
                                || ((mode) == HAL_ADF_SITF_MODE_MANCHESTER_RISING))

/**
  * @brief Serial interface clock source
  */
#define IS_ADF_SITF_CLOCK_SOURCE(source) (((source) == HAL_ADF_SITF_CLOCK_SOURCE_CCK0) \
                                          || ((source) == HAL_ADF_SITF_CLOCK_SOURCE_CCK1))

/**
  * @brief Serial interface threshold
  */
#define IS_ADF_SITF_THRESHOLD(value) ((4U <= (value)) && ((value) <= 31U))

/**
  * @brief Bitstream matrix input edge
  */
#define IS_ADF_BSMX_INPUT_EDGE(edge) (((edge) == HAL_ADF_BSMX_INPUT_RISING) \
                                      || ((edge) == HAL_ADF_BSMX_INPUT_FALLING))

/**
  * @brief Digital filter data source
  */
#define IS_ADF_DFLT_DATA_SOURCE(source) ((source) == HAL_ADF_DFLT_DATA_SOURCE_BSMX)

/**
  * @brief Digital filter CIC mode
  */
#define IS_ADF_DFLT_CIC_MODE(mode) (((mode) == HAL_ADF_DFLT_CIC_ONE_FILTER_SINC4) \
                                    || ((mode) == HAL_ADF_DFLT_CIC_ONE_FILTER_SINC5))

/**
  * @brief Digital filter decimation ratio
  */
#define IS_ADF_DFLT_DECIMATION_RATIO(value) ((2U <= (value)) && ((value) <= 512U))

/**
  * @brief Digital filter gain
  */
#define IS_ADF_DFLT_GAIN(value) ((-16 <= (value)) && ((value) <= 24))

/**
  * @brief Digital filter acquisition mode
  */
#define IS_ADF_DFLT_ACQUISITION_MODE(mode) (((mode) == HAL_ADF_DFLT_ACQ_MODE_ASYNC_CONT) \
                                            || ((mode) == HAL_ADF_DFLT_ACQ_MODE_ASYNC_SINGLE) \
                                            || ((mode) == HAL_ADF_DFLT_ACQ_MODE_SYNC_CONT) \
                                            || ((mode) == HAL_ADF_DFLT_ACQ_MODE_SYNC_SINGLE) \
                                            || ((mode) == HAL_ADF_DFLT_ACQ_MODE_WINDOW_CONT))

/**
  * @brief Digital filter trigger source
  */
#define IS_ADF_DFLT_TRIGGER_SOURCE(source) (((source) == HAL_ADF_DFLT_TRIG_TRGO) \
                                            || ((source) == HAL_ADF_DFLT_TRIG_EXTI15))

/**
  * @brief Digital filter trigger edge
  */
#define IS_ADF_DFLT_TRIGGER_EDGE(edge) (((edge) == HAL_ADF_DFLT_TRIG_RISING_EDGE) \
                                        || ((edge) == HAL_ADF_DFLT_TRIG_FALLING_EDGE))

/**
  * @brief Digital filter samples delay
  */
#define IS_ADF_DFLT_SAMPLES_DELAY(value) ((value) <= 127U)

/**
  * @brief Digital filter FIFO threshold
  */
#define IS_ADF_DFLT_FIFO_THRESHOLD(value) (((value) == HAL_ADF_DFLT_FIFO_THRESHOLD_NOT_EMPTY) \
                                           || ((value) == HAL_ADF_DFLT_FIFO_THRESHOLD_HALF_FULL))

/**
  * @brief Digital filter discard samples
  */
#define IS_ADF_DFLT_DISCARD_SAMPLES(value) ((value) <= 255U)

/**
  * @brief Digital filter reshape filter decimation ratio
  */
#define IS_ADF_DFLT_RSF_DECIMATION_RATIO(value) (((value) == HAL_ADF_DFLT_RSF_DR_4) \
                                                 || ((value) == HAL_ADF_DFLT_RSF_DR_1))

/**
  * @brief Digital filter high-pass filter cut-off frequency
  */
#define IS_ADF_DFLT_HPF_CUT_OFF_FREQUENCY(value) (((value) == HAL_ADF_DFLT_HPF_CUT_OFF_0_000625FPCM) \
                                                  || ((value) == HAL_ADF_DFLT_HPF_CUT_OFF_0_00125FPCM) \
                                                  || ((value) == HAL_ADF_DFLT_HPF_CUT_OFF_0_0025FPCM) \
                                                  || ((value) == HAL_ADF_DFLT_HPF_CUT_OFF_0_0095FPCM))

/**
  * @brief Digital filter optional interruptions
  */
#define IS_ADF_DFLT_OPTIONAL_IT(value) ((value) <= HAL_ADF_DFLT_OPT_IT_DEFAULT)

#if defined (USE_HAL_ADF_DMA) && (USE_HAL_ADF_DMA == 1)
/**
  * @brief Digital filter DMA data resolution
  */
#define IS_ADF_DFLT_DMA_DATA_RESOLUTION(value) (((value) == HAL_ADF_DMA_DATA_RESOLUTION_FULL) \
                                                || ((value) == HAL_ADF_DMA_DATA_RESOLUTION_MSB_ONLY))
#endif /* USE_HAL_ADF_DMA */

/**
  * @brief Sound activity detector mode
  */
#define IS_ADF_SAD_MODE(value) (((value) == HAL_ADF_SAD_MODE_VOICE_ACTIVITY) \
                                || ((value) == HAL_ADF_SAD_MODE_SOUND) \
                                || ((value) == HAL_ADF_SAD_MODE_AMBIENT_NOISE))

/**
  * @brief Sound activity detector memory transfer
  */
#define IS_ADF_SAD_MEMORY_TRANSFER(value) (((value) == HAL_ADF_SAD_MEMORY_TRANSFER_NO) \
                                           || ((value) == HAL_ADF_SAD_MEMORY_TRANSFER_DURING_DETECTION) \
                                           || ((value) == HAL_ADF_SAD_MEMORY_TRANSFER_ALWAYS))

/**
  * @brief Sound activity detector trigger event
  */
#define IS_ADF_SAD_TRIGGER_EVENT(value) (((value) == HAL_ADF_SAD_TRIGGER_ENTER_DETECT) \
                                         || ((value) == HAL_ADF_SAD_TRIGGER_ENTER_EXIT_DETECT))

/**
  * @brief Sound activity detector minimum ambient noise
  */
#define IS_ADF_SAD_MINIMUM_AMBIENT_NOISE(value) ((value) <= 8191U)

/**
  * @brief Sound activity detector frame size
  */
#define IS_ADF_SAD_FRAME_SIZE(value) (((value) == HAL_ADF_SAD_FRAME_SIZE_8_PCM_SAMPLES) \
                                      || ((value) == HAL_ADF_SAD_FRAME_SIZE_16_PCM_SAMPLES) \
                                      || ((value) == HAL_ADF_SAD_FRAME_SIZE_32_PCM_SAMPLES) \
                                      || ((value) == HAL_ADF_SAD_FRAME_SIZE_64_PCM_SAMPLES) \
                                      || ((value) == HAL_ADF_SAD_FRAME_SIZE_128_PCM_SAMPLES) \
                                      || ((value) == HAL_ADF_SAD_FRAME_SIZE_256_PCM_SAMPLES) \
                                      || ((value) == HAL_ADF_SAD_FRAME_SIZE_512_PCM_SAMPLES))

/**
  * @brief Sound activity detector learning frames
  */
#define IS_ADF_SAD_LEARNING_FRAMES(value) (((value) == HAL_ADF_SAD_LEARNING_FRAMES_2) \
                                           || ((value) == HAL_ADF_SAD_LEARNING_FRAMES_4) \
                                           || ((value) == HAL_ADF_SAD_LEARNING_FRAMES_8) \
                                           || ((value) == HAL_ADF_SAD_LEARNING_FRAMES_16) \
                                           || ((value) == HAL_ADF_SAD_LEARNING_FRAMES_32))

/**
  * @brief Sound activity detector signal to noise threshold
  */
#define IS_ADF_SAD_SIGNAL_TO_NOISE_THRESHOLD(value) (((value) == HAL_ADF_SAD_SIGNAL_TO_NOISE_3_5_DB) \
                                                     || ((value) == HAL_ADF_SAD_SIGNAL_TO_NOISE_6_DB) \
                                                     || ((value) == HAL_ADF_SAD_SIGNAL_TO_NOISE_9_5_DB) \
                                                     || ((value) == HAL_ADF_SAD_SIGNAL_TO_NOISE_12_DB) \
                                                     || ((value) == HAL_ADF_SAD_SIGNAL_TO_NOISE_15_6_DB) \
                                                     || ((value) == HAL_ADF_SAD_SIGNAL_TO_NOISE_18_DB) \
                                                     || ((value) == HAL_ADF_SAD_SIGNAL_TO_NOISE_21_6_DB) \
                                                     || ((value) == HAL_ADF_SAD_SIGNAL_TO_NOISE_24_1_DB) \
                                                     || ((value) == HAL_ADF_SAD_SIGNAL_TO_NOISE_27_6_DB) \
                                                     || ((value) == HAL_ADF_SAD_SIGNAL_TO_NOISE_30_1_DB))

/**
  * @brief Sound activity detector ambient noise slope
  */
#define IS_ADF_SAD_AMBIENT_NOISE_SLOPE(value) ((value) <= 7U)

/**
  * @brief Sound activity detector hangover time window
  */
#define IS_ADF_SAD_HANGOVER_TIME_WINDOW(value) (((value) == HAL_ADF_SAD_HANGOVER_TIME_4_FRAMES) \
                                                || ((value) == HAL_ADF_SAD_HANGOVER_TIME_8_FRAMES) \
                                                || ((value) == HAL_ADF_SAD_HANGOVER_TIME_16_FRAMES) \
                                                || ((value) == HAL_ADF_SAD_HANGOVER_TIME_32_FRAMES) \
                                                || ((value) == HAL_ADF_SAD_HANGOVER_TIME_64_FRAMES) \
                                                || ((value) == HAL_ADF_SAD_HANGOVER_TIME_128_FRAMES) \
                                                || ((value) == HAL_ADF_SAD_HANGOVER_TIME_256_FRAMES) \
                                                || ((value) == HAL_ADF_SAD_HANGOVER_TIME_512_FRAMES))

/**
  * @brief Sound activity detector optional interruptions
  */
#define IS_ADF_SAD_OPTIONAL_IT(value) ((value) <= HAL_ADF_SAD_OPT_IT_DEFAULT)

/**
  * @}
  */

