STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.c
/* Private function prototypes -----------------------------------------------*/
/** @defgroup ADF_Private_Functions ADF Private Functions
  * @{
  */

static uint32_t ADF_AdjustGainToRegisterValue(int32_t gain);
static int32_t  ADF_AdjustGainFromRegisterValue(uint32_t register_gain);

static void ADF_DFLT_EnableInterruptions(ADF_Block_TypeDef *p_adf_block);
static void ADF_DFLT_EnableInterruptions_Opt(ADF_Block_TypeDef *p_adf_block, uint32_t interruptions);

#if defined (USE_HAL_ADF_DMA) && (USE_HAL_ADF_DMA == 1)
static hal_adf_block_index_t ADF_DFLT_GetBlockIndexFromDmaHandle(const hal_adf_handle_t *hadf,
                                                                 const hal_dma_handle_t *hdma);
static void ADF_DFLT_DMA_Cplt(hal_dma_handle_t *hdma);
static void ADF_DFLT_DMA_HalfCplt(hal_dma_handle_t *hdma);
static void ADF_DFLT_DMA_Error(hal_dma_handle_t *hdma);
static void ADF_DFLT_DMA_Abort(hal_dma_handle_t *hdma);
#endif /* USE_HAL_ADF_DMA */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup ADF_Exported_Functions
  * @{
  */

/** @addtogroup ADF_Exported_Functions_Group1
  * @{
This section provides a set of functions allowing to initialize and deinitialize the ADF peripheral:
  - Call the function HAL_ADF_Init() to initialize the selected ADF handle.
  - Call the function HAL_ADF_DeInit() to deinitialize the ADF.
  */

/**
  * @brief  Initialize the ADF according to the associated handle.
  * @param  hadf              Pointer to a hal_adf_handle_t.
  * @param  instance          HAL ADF instance.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM Pointer to HAL ADF handle is NULL.
  */
hal_status_t HAL_ADF_Init(hal_adf_handle_t *hadf, hal_adf_t instance)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_ALL_INSTANCE((ADF_TypeDef *)(uint32_t)instance));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hadf == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hadf->instance = instance;

#if defined(USE_HAL_ADF_CLK_ENABLE_MODEL) && (USE_HAL_ADF_CLK_ENABLE_MODEL >= HAL_CLK_ENABLE_PERIPH_ONLY)
  HAL_RCC_ADF1_EnableClock();
#endif /* USE_HAL_ADF_CLK_ENABLE_MODEL */

#if defined (USE_HAL_ADF_USER_DATA) && (USE_HAL_ADF_USER_DATA == 1)
  hadf->p_user_data = (void *) NULL;
#endif /* USE_HAL_ADF_USER_DATA */

#if defined(USE_HAL_ADF_REGISTER_CALLBACKS) && (USE_HAL_ADF_REGISTER_CALLBACKS == 1)
  /* Initialize HAL ADF callbacks */
  hadf->p_acquisition_cplt_cb      = HAL_ADF_DFLT_AcqCpltCallback;
  hadf->p_acquisition_half_cplt_cb = HAL_ADF_DFLT_AcqHalfCpltCallback;
  hadf->p_acquisition_stop_cb      = HAL_ADF_DFLT_AcqStopCpltCallback;
  hadf->p_sound_level_cb           = HAL_ADF_SAD_SoundLevelCallback;
  hadf->p_sound_activity_cb        = HAL_ADF_SAD_SoundActivityCallback;
  hadf->p_error_cb                 = HAL_ADF_ErrorCallback;
#endif  /* USE_HAL_ADF_REGISTER_CALLBACKS */

  for (uint8_t i = 0U; i < ADF1_BLOCKS_NUMBER; i++)
  {
#if defined (USE_HAL_ADF_DMA) && (USE_HAL_ADF_DMA == 1)
    hadf->hdma[i] = NULL;
#endif /* USE_HAL_ADF_DMA */

#if defined(USE_HAL_ADF_GET_LAST_ERRORS) && (USE_HAL_ADF_GET_LAST_ERRORS == 1)
    hadf->last_error_codes[i] = HAL_ADF_ERROR_NONE;
#endif /* USE_HAL_ADF_GET_LAST_ERRORS */

    /* Reset all sub-block states */
    hadf->serial_interface_states[i]        = HAL_ADF_SITF_STATE_RESET;
    hadf->digital_filter_states[i]          = HAL_ADF_DFLT_STATE_RESET;
    hadf->sound_activity_detector_states[i] = HAL_ADF_SAD_STATE_RESET;
  }

  hadf->global_state = HAL_ADF_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief De-initialize the ADF.
  * @param hadf Pointer to a hal_adf_handle_t.
  */
void HAL_ADF_DeInit(hal_adf_handle_t *hadf)
{
  ADF_Block_TypeDef *p_adf_block;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_ALL_INSTANCE((ADF_TypeDef *)(uint32_t)hadf->instance));

  for (uint8_t i = 0U; i < ADF1_BLOCKS_NUMBER; i++)
  {
    p_adf_block = ADF_GET_BLOCK(hadf, i);

#if defined (USE_HAL_ADF_DMA) && (USE_HAL_ADF_DMA == 1)
    /* Abort potential DMA in progress */
    if ((hadf->digital_filter_states[i] == HAL_ADF_DFLT_STATE_ACTIVE) && (hadf->hdma[i] != NULL))
    {
      (void) HAL_DMA_Abort(hadf->hdma[i]);
    }
#endif /* USE_HAL_ADF_DMA */

    /* Disable all sub-blocks */
    CLEAR_BIT(p_adf_block->SADCR, ADF_SADCR_SADEN);
    CLEAR_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DFLTEN);
    CLEAR_BIT(p_adf_block->SITFCR, ADF_SITFCR_SITFEN);

    /* Disable all block interruptions */
    CLEAR_REG(p_adf_block->DFLTIER);

    /* Clear block pending flags */
    WRITE_REG(p_adf_block->DFLTISR, (ADF_DFLTISR_DOVRF | ADF_DFLTISR_SATF | ADF_DFLTISR_CKABF | ADF_DFLTISR_RFOVRF
                                     | ADF_DFLTISR_SDDETF | ADF_DFLTISR_SDLVLF));

    /* Reset all sub-block states */
    hadf->serial_interface_states[i]        = HAL_ADF_SITF_STATE_RESET;
    hadf->digital_filter_states[i]          = HAL_ADF_DFLT_STATE_RESET;
    hadf->sound_activity_detector_states[i] = HAL_ADF_SAD_STATE_RESET;
  }

  /* Disable clock generator */
  CLEAR_BIT(ADF_GET_INSTANCE(hadf)->CKGCR, ADF_CKGCR_CKGDEN);

  hadf->global_state = HAL_ADF_STATE_RESET;
}

/**
  * @}
  */

/** @addtogroup ADF_Exported_Functions_Group2
  * @{
This section provides a set of functions allowing to configure common clock generator and features:
  - Call the function HAL_ADF_SetConfig() to configure processing clock divider.
  - Call the function HAL_ADF_GetConfig() to get the current processing clock divider.
  - Call the function HAL_ADF_SetConfigOutputClock() to configure output clock pins and divider.
  - Call the function HAL_ADF_GetConfigOutputClock() to get the current output clock pins and divider.
  - Call the function HAL_ADF_SetConfigOutputClockTrigger() to configure output clock trigger and edge.
  - Call the function HAL_ADF_GetConfigOutputClockTrigger() to get the current output clock trigger and edge.
  - Call the function HAL_ADF_SetDMA() to link DMA handle for a specified block to the ADF handle.
  - Call the function HAL_ADF_GetClockFreq() to get the current ADF kernel clock frequency.
  - Call the function HAL_ADF_SetUserData() to set user data in ADF handle.
  - Call the function HAL_ADF_GetUserData() to get user data from ADF handle.
  - Call the function HAL_ADF_GetLastErrorCodes() to get last error codes on a specified block.

This section provides also a set of functions allowing to control common features:
  - Call the function HAL_ADF_EnableOutputClock() to enable output clock pins.
  - Call the function HAL_ADF_DisableOutputClock() to disable output clock pins.
  - Call the function HAL_ADF_IsEnabledOutputClock() to check output clock pins status.
  - Call the function HAL_ADF_EnableOutputClockTrigger() to enable output clock trigger.
  - Call the function HAL_ADF_DisableOutputClockTrigger() to disable output clock trigger.
  - Call the function HAL_ADF_IsEnabledOutputClockTrigger() to check output clock trigger status.
  - Call the function HAL_ADF_EnableTriggerOutput() to enable trigger output.
  - Call the function HAL_ADF_IsEnabledTriggerOutput() to check trigger output status.

This section provides also a set of functions allowing to process common clock generator:
  - Call the function HAL_ADF_Start() to activate clock generator.
  - Call the function HAL_ADF_Stop() to deactivate clock generator.
  */

