STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.c
/* Configuration functions */
/**
  * @brief  Configure processing clock divider.
  * @param  hadf               Pointer to a hal_adf_handle_t.
  * @param  proc_clock_divider Processing clock divider.
  *                            This parameter must be a number between Min_Data = 1 and Max_Data = 128.
  * @retval HAL_OK             Operation completed successfully.
  */
hal_status_t HAL_ADF_SetConfig(hal_adf_handle_t *hadf, uint32_t proc_clock_divider)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_PROC_CLOCK_DIVIDER(proc_clock_divider));

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_INIT | (uint32_t)HAL_ADF_STATE_IDLE);

  MODIFY_REG(ADF_GET_INSTANCE(hadf)->CKGCR, ADF_CKGCR_PROCDIV_Msk, (proc_clock_divider - 1U) << ADF_CKGCR_PROCDIV_Pos);

  hadf->global_state = HAL_ADF_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Get the current processing clock divider.
  * @param hadf                 Pointer to a hal_adf_handle_t.
  * @param p_proc_clock_divider Pointer to processing clock divider.
  */
void HAL_ADF_GetConfig(const hal_adf_handle_t *hadf, uint32_t *p_proc_clock_divider)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(p_proc_clock_divider != NULL);

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_IDLE | (uint32_t)HAL_ADF_STATE_ACTIVE);

  *p_proc_clock_divider = ((READ_REG(ADF_GET_INSTANCE(hadf)->CKGCR) & ADF_CKGCR_PROCDIV_Msk)
                           >> ADF_CKGCR_PROCDIV_Pos) + 1U;
}

/**
  * @brief  Configure output clock pins and divider.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  pins                 Output clock pins.
  * @param  output_clock_divider Output clock divider.
  *                              This parameter must be a number between Min_Data = 1 and Max_Data = 16.
  * @retval HAL_OK               Operation completed successfully.
  */
hal_status_t HAL_ADF_SetConfigOutputClock(const hal_adf_handle_t *hadf, hal_adf_output_clock_pins_t pins,
                                          uint32_t output_clock_divider)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_OUTPUT_CLOCK_PINS(pins));
  ASSERT_DBG_PARAM(IS_ADF_OUTPUT_CLOCK_DIVIDER(output_clock_divider));

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_IDLE);

  MODIFY_REG(ADF_GET_INSTANCE(hadf)->CKGCR, ADF_CKGCR_CCK0DIR_Msk | ADF_CKGCR_CCK1DIR_Msk | ADF_CKGCR_CCKDIV_Msk,
             (uint32_t)pins | ((output_clock_divider - 1U) << ADF_CKGCR_CCKDIV_Pos));

  return HAL_OK;
}

/**
  * @brief Get the current output clock pins and divider.
  * @param hadf                   Pointer to a hal_adf_handle_t.
  * @param p_pins                 Pointer to output clock pins.
  * @param p_output_clock_divider Pointer to output clock divider.
  */
void HAL_ADF_GetConfigOutputClock(const hal_adf_handle_t *hadf, hal_adf_output_clock_pins_t *p_pins,
                                  uint32_t *p_output_clock_divider)
{
  uint32_t ckgcr_reg;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(p_pins != NULL);
  ASSERT_DBG_PARAM(p_output_clock_divider != NULL);

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_IDLE | (uint32_t)HAL_ADF_STATE_ACTIVE);

  ckgcr_reg = READ_REG(ADF_GET_INSTANCE(hadf)->CKGCR);
  *p_pins = (hal_adf_output_clock_pins_t)(uint32_t)(ckgcr_reg & (ADF_CKGCR_CCK0DIR_Msk | ADF_CKGCR_CCK1DIR_Msk));
  *p_output_clock_divider = ((ckgcr_reg & ADF_CKGCR_CCKDIV_Msk) >> ADF_CKGCR_CCKDIV_Pos) + 1U;
}

/**
  * @brief  Configure output clock trigger and edge.
  * @param  hadf   Pointer to a hal_adf_handle_t.
  * @param  source Output clock trigger source.
  * @param  edge   Output clock trigger edge.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_ADF_SetConfigOutputClockTrigger(const hal_adf_handle_t *hadf,
                                                 hal_adf_output_clock_trigger_source_t source,
                                                 hal_adf_output_clock_trigger_edge_t edge)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_OUTPUT_CLOCK_TRIGGER_SOURCE(source));
  ASSERT_DBG_PARAM(IS_ADF_OUTPUT_CLOCK_TRIGGER_EDGE(edge));

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_IDLE);

  MODIFY_REG(ADF_GET_INSTANCE(hadf)->CKGCR, ADF_CKGCR_TRGSRC_Msk | ADF_CKGCR_TRGSENS_Msk,
             (uint32_t)source | (uint32_t)edge);

  return HAL_OK;
}

/**
  * @brief Get the current output clock trigger and edge.
  * @param hadf     Pointer to a hal_adf_handle_t.
  * @param p_source Pointer to output clock trigger source.
  * @param p_edge   Pointer to output clock trigger edge.
  */
void HAL_ADF_GetConfigOutputClockTrigger(const hal_adf_handle_t *hadf,
                                         hal_adf_output_clock_trigger_source_t *p_source,
                                         hal_adf_output_clock_trigger_edge_t *p_edge)
{
  uint32_t ckgcr_reg;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(p_source != NULL);
  ASSERT_DBG_PARAM(p_edge != NULL);

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_IDLE | (uint32_t)HAL_ADF_STATE_ACTIVE);

  ckgcr_reg = READ_REG(ADF_GET_INSTANCE(hadf)->CKGCR);
  *p_source = (hal_adf_output_clock_trigger_source_t)(uint32_t)(ckgcr_reg & ADF_CKGCR_TRGSRC_Msk);
  *p_edge = (hal_adf_output_clock_trigger_edge_t)(uint32_t)(ckgcr_reg & ADF_CKGCR_TRGSENS_Msk);
}

#if defined (USE_HAL_ADF_DMA) && (USE_HAL_ADF_DMA == 1)
/**
  * @brief  Link DMA handle for a specified block to the ADF handle.
  * @param  hadf              Pointer to a hal_adf_handle_t.
  * @param  block_index       Block index.
  * @param  hdma              Pointer to DMA handle.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM Pointer to DMA handle is NULL.
  */
hal_status_t HAL_ADF_SetDMA(hal_adf_handle_t *hadf,
                            hal_adf_block_index_t block_index,
                            hal_dma_handle_t *hdma)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(hdma != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)block_index));

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_IDLE | (uint32_t)HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[block_index],
                   (uint32_t)HAL_ADF_DFLT_STATE_RESET | (uint32_t)HAL_ADF_DFLT_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hadf->hdma[block_index] = hdma;
  hdma->p_parent = hadf;

  return HAL_OK;
}
#endif /* USE_HAL_ADF_DMA */

/**
  * @brief  Get the current ADF kernel clock frequency.
  * @param  hadf     Pointer to a hal_adf_handle_t.
  * @retval uint32_t ADF kernel clock frequency in Hz.
  * @retval 0        ADF source clock not configured or not ready.
  */
uint32_t HAL_ADF_GetClockFreq(const hal_adf_handle_t *hadf)
{
  ASSERT_DBG_PARAM(hadf != NULL);

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_INIT | (uint32_t)HAL_ADF_STATE_IDLE
                   | (uint32_t)HAL_ADF_STATE_ACTIVE);

#if (!defined(USE_ASSERT_DBG_STATE) && !defined(USE_ASSERT_DBG_PARAM))
  STM32_UNUSED(hadf);
#endif /* (!defined(USE_ASSERT_DBG_STATE) && !defined(USE_ASSERT_DBG_PARAM)) */

  return HAL_RCC_ADF1_GetKernelClkFreq();
}

#if defined (USE_HAL_ADF_USER_DATA) && (USE_HAL_ADF_USER_DATA == 1)
/**
  * @brief Set user data in ADF handle.
  * @param hadf        Pointer to a hal_adf_handle_t.
  * @param p_user_data Pointer to user data structure.
  */
void HAL_ADF_SetUserData(hal_adf_handle_t *hadf, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hadf != NULL);

