STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.c
  hadf->p_user_data = p_user_data;
}

/**
  * @brief  Get user data from ADF handle.
  * @param  hadf Pointer to a hal_adf_handle_t.
  * @retval void Pointer to user data structure.
  */
const void *HAL_ADF_GetUserData(const hal_adf_handle_t *hadf)
{
  ASSERT_DBG_PARAM(hadf != NULL);

  return hadf->p_user_data;
}
#endif /* USE_HAL_ADF_USER_DATA */

#if defined(USE_HAL_ADF_GET_LAST_ERRORS) && (USE_HAL_ADF_GET_LAST_ERRORS == 1)
/**
  * @brief  Get last error codes on a specified block.
  * @param  hadf        Pointer to a hal_adf_handle_t.
  * @param  block_index Block index.
  * @retval uint32_t    Last error codes on the specified block.
  *                     This return value can be a combination of the following values:
  *                       @arg @ref HAL_ADF_ERROR_NONE
  *                       @arg @ref HAL_ADF_ERROR_DFLT_ACQ_OVERFLOW
  *                       @arg @ref HAL_ADF_ERROR_DFLT_RSF_OVERRUN
  *                       @arg @ref HAL_ADF_ERROR_SITF_CLOCK_ABSENCE
  *                       @arg @ref HAL_ADF_ERROR_DFLT_SATURATION
  *                       @arg @ref HAL_ADF_ERROR_DMA
  */
uint32_t HAL_ADF_GetLastErrorCodes(const hal_adf_handle_t *hadf,
                                   hal_adf_block_index_t block_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)block_index));

  return hadf->last_error_codes[block_index];
}
#endif /* USE_HAL_ADF_GET_LAST_ERRORS */

/* Control functions */
/**
  * @brief  Enable output clock pins.
  * @param  hadf   Pointer to a hal_adf_handle_t.
  * @param  pins   Output clock pins.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_ADF_EnableOutputClock(const hal_adf_handle_t *hadf, hal_adf_output_clock_pins_t pins)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_OUTPUT_CLOCK_PINS(pins));

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_IDLE | (uint32_t)HAL_ADF_STATE_ACTIVE);

  SET_BIT(ADF_GET_INSTANCE(hadf)->CKGCR, (uint32_t)pins >> 4U);

  return HAL_OK;
}

/**
  * @brief  Disable output clock pins.
  * @param  hadf   Pointer to a hal_adf_handle_t.
  * @param  pins   Output clock pins.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_ADF_DisableOutputClock(const hal_adf_handle_t *hadf, hal_adf_output_clock_pins_t pins)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_OUTPUT_CLOCK_PINS(pins));

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_IDLE | (uint32_t)HAL_ADF_STATE_ACTIVE);

  CLEAR_BIT(ADF_GET_INSTANCE(hadf)->CKGCR, (uint32_t)pins >> 4U);

  return HAL_OK;
}

/**
  * @brief  Check output clock pins status.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @retval hal_adf_output_clock_status_t Output clock pins status.
  */
hal_adf_output_clock_status_t HAL_ADF_IsEnabledOutputClock(const hal_adf_handle_t *hadf)
{
  ASSERT_DBG_PARAM(hadf != NULL);

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_IDLE | (uint32_t)HAL_ADF_STATE_ACTIVE);

  return (hal_adf_output_clock_status_t)(uint32_t)((READ_REG(ADF_GET_INSTANCE(hadf)->CKGCR)
                                                    & (ADF_CKGCR_CCK0EN_Msk | ADF_CKGCR_CCK1EN_Msk)) >> 1U);
}

/**
  * @brief  Enable output clock trigger.
  * @param  hadf   Pointer to a hal_adf_handle_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_ADF_EnableOutputClockTrigger(const hal_adf_handle_t *hadf)
{
  ASSERT_DBG_PARAM(hadf != NULL);

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_IDLE);

  SET_BIT(ADF_GET_INSTANCE(hadf)->CKGCR, ADF_CKGCR_CKGMOD);

  return HAL_OK;
}

/**
  * @brief  Disable output clock trigger.
  * @param  hadf   Pointer to a hal_adf_handle_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_ADF_DisableOutputClockTrigger(const hal_adf_handle_t *hadf)
{
  ASSERT_DBG_PARAM(hadf != NULL);

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_IDLE);

  CLEAR_BIT(ADF_GET_INSTANCE(hadf)->CKGCR, ADF_CKGCR_CKGMOD);

  return HAL_OK;
}

/**
  * @brief  Check output clock trigger status.
  * @param  hadf                                  Pointer to a hal_adf_handle_t.
  * @retval hal_adf_output_clock_trigger_status_t Output clock trigger status.
  */
hal_adf_output_clock_trigger_status_t HAL_ADF_IsEnabledOutputClockTrigger(const hal_adf_handle_t *hadf)
{
  hal_adf_output_clock_trigger_status_t status;

  ASSERT_DBG_PARAM(hadf != NULL);

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_IDLE | (uint32_t)HAL_ADF_STATE_ACTIVE);

  status = (IS_BIT_SET(ADF_GET_INSTANCE(hadf)->CKGCR, ADF_CKGCR_CKGMOD)) ? HAL_ADF_OUT_CLOCK_TRIG_ENABLED
           : HAL_ADF_OUT_CLOCK_TRIG_DISABLED;

  return status;
}

/**
  * @brief  Enable trigger output.
  * @param  hadf   Pointer to a hal_adf_handle_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_ADF_EnableTriggerOutput(const hal_adf_handle_t *hadf)
{
  ASSERT_DBG_PARAM(hadf != NULL);

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_IDLE | (uint32_t)HAL_ADF_STATE_ACTIVE);

  SET_BIT(ADF_GET_INSTANCE(hadf)->GCR, ADF_GCR_TRGO);

  return HAL_OK;
}

/**
  * @brief  Check trigger output status.
  * @param  hadf                            Pointer to a hal_adf_handle_t.
  * @retval hal_adf_trigger_output_status_t Trigger output status.
  */
hal_adf_trigger_output_status_t HAL_ADF_IsEnabledTriggerOutput(const hal_adf_handle_t *hadf)
{
  hal_adf_trigger_output_status_t status;

  ASSERT_DBG_PARAM(hadf != NULL);

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_IDLE | (uint32_t)HAL_ADF_STATE_ACTIVE);

  status = (IS_BIT_SET(ADF_GET_INSTANCE(hadf)->GCR, ADF_GCR_TRGO)) ? HAL_ADF_TRIGGER_OUTPUT_ENABLED
           : HAL_ADF_TRIGGER_OUTPUT_DISABLED;

  return status;
}

/* Process functions */
/**
  * @brief  Activate clock generator.
  * @param  hadf     Pointer to a hal_adf_handle_t.
  * @retval HAL_OK   Operation completed successfully.
  * @retval HAL_BUSY The global state is not HAL_ADF_STATE_IDLE (USE_HAL_CHECK_PROCESS_STATE is set to 1).
  */
hal_status_t HAL_ADF_Start(hal_adf_handle_t *hadf)
{
  ASSERT_DBG_PARAM(hadf != NULL);

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_IDLE);

