STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.c
  HAL_CHECK_UPDATE_STATE(hadf, global_state, HAL_ADF_STATE_IDLE, HAL_ADF_STATE_ACTIVE);

  SET_BIT(ADF_GET_INSTANCE(hadf)->CKGCR, ADF_CKGCR_CKGDEN);

  return HAL_OK;
}

/**
  * @brief  Deactivate clock generator.
  * @param  hadf   Pointer to a hal_adf_handle_t.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_ADF_Stop(hal_adf_handle_t *hadf)
{
  ASSERT_DBG_PARAM(hadf != NULL);

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_ACTIVE);

  for (uint8_t i = 0U; i < ADF1_BLOCKS_NUMBER; i++)
  {
    ASSERT_DBG_STATE(hadf->serial_interface_states[i], (uint32_t)HAL_ADF_SITF_STATE_RESET
                     | (uint32_t)HAL_ADF_SITF_STATE_IDLE);
    ASSERT_DBG_STATE(hadf->digital_filter_states[i], (uint32_t)HAL_ADF_DFLT_STATE_RESET
                     | (uint32_t)HAL_ADF_DFLT_STATE_IDLE);
    ASSERT_DBG_STATE(hadf->sound_activity_detector_states[i], (uint32_t)HAL_ADF_SAD_STATE_RESET
                     | (uint32_t)HAL_ADF_SAD_STATE_IDLE);
  }

  CLEAR_BIT(ADF_GET_INSTANCE(hadf)->CKGCR, ADF_CKGCR_CKGDEN);

  hadf->global_state = HAL_ADF_STATE_IDLE;

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup ADF_Exported_Functions_Group3
  * @{
This section provides a set of functions allowing to configure and process serial interface:
  - Call the function HAL_ADF_SITF_SetConfig() to configure a specified serial interface.
  - Call the function HAL_ADF_SITF_GetConfig() to get the current configuration of a specified serial interface.
  - Call the function HAL_ADF_SITF_Start() to activate a specified serial interface.
  - Call the function HAL_ADF_SITF_Stop() to deactivate a specified serial interface.

This section provides also a set of functions for clock absence detection feature:
  - Call the function HAL_ADF_SITF_IsClockAbsenceDetected() to check clock absence detection status on a specified
    serial interface.
  - Call the function HAL_ADF_SITF_StartClockAbsenceDetect_IT() to start clock absence detection in interrupt mode
    on a specified serial interface.
  - Call the function HAL_ADF_SITF_StopClockAbsenceDetect_IT() to stop clock absence detection in interrupt mode
    on a specified serial interface.
  */

/* Configuration functions */
/**
  * @brief  Configure a specified serial interface.
  * @param  hadf                   Pointer to a hal_adf_handle_t.
  * @param  serial_interface_index Serial interface index.
  * @param  p_config               Pointer to serial interface configuration structure.
  * @retval HAL_OK                 Operation completed successfully.
  * @retval HAL_INVALID_PARAM      Pointer to serial interface configuration structure is NULL.
  */
hal_status_t HAL_ADF_SITF_SetConfig(hal_adf_handle_t *hadf,
                                    hal_adf_block_index_t serial_interface_index,
                                    const hal_adf_serial_interface_config_t *p_config)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)serial_interface_index));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_ADF_SITF_MODE(p_config->mode));
  ASSERT_DBG_PARAM(IS_ADF_SITF_CLOCK_SOURCE(p_config->clock_source));
  ASSERT_DBG_PARAM(IS_ADF_SITF_THRESHOLD(p_config->threshold));

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->serial_interface_states[serial_interface_index], (uint32_t)HAL_ADF_SITF_STATE_RESET
                   | (uint32_t)HAL_ADF_SITF_STATE_IDLE);

  MODIFY_REG(ADF_GET_BLOCK(hadf, serial_interface_index)->SITFCR,
             ADF_SITFCR_SCKSRC_Msk | ADF_SITFCR_SITFMOD_Msk | ADF_SITFCR_STH_Msk,
             (uint32_t)p_config->clock_source | (uint32_t)p_config->mode
             | (p_config->threshold << ADF_SITFCR_STH_Pos));

  hadf->serial_interface_states[serial_interface_index] = HAL_ADF_SITF_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Get the current configuration of a specified serial interface.
  * @param hadf                   Pointer to a hal_adf_handle_t.
  * @param serial_interface_index Serial interface index.
  * @param p_config               Pointer to serial interface configuration structure.
  */
void HAL_ADF_SITF_GetConfig(const hal_adf_handle_t *hadf,
                            hal_adf_block_index_t serial_interface_index,
                            hal_adf_serial_interface_config_t *p_config)
{
  uint32_t sitfcr_reg;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)serial_interface_index));

  ASSERT_DBG_STATE(hadf->global_state, (uint32_t)HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->serial_interface_states[serial_interface_index], (uint32_t)HAL_ADF_SITF_STATE_IDLE
                   | (uint32_t)HAL_ADF_SITF_STATE_ACTIVE);

  sitfcr_reg = READ_REG(ADF_GET_BLOCK(hadf, serial_interface_index)->SITFCR);
  p_config->mode = (hal_adf_serial_interface_mode_t)(uint32_t)(sitfcr_reg & ADF_SITFCR_SITFMOD_Msk);
  p_config->clock_source = (hal_adf_serial_interface_clock_source_t)(uint32_t)(sitfcr_reg & ADF_SITFCR_SCKSRC_Msk);
  p_config->threshold = ((sitfcr_reg & ADF_SITFCR_STH_Msk) >> ADF_SITFCR_STH_Pos);
}

/* Process functions */
/**
  * @brief  Activate a specified serial interface.
  * @param  hadf                   Pointer to a hal_adf_handle_t.
  * @param  serial_interface_index Serial interface index.
  * @retval HAL_OK                 Operation completed successfully.
  * @retval HAL_BUSY               The serial interface state is not HAL_ADF_SITF_STATE_IDLE
  *                                (USE_HAL_CHECK_PROCESS_STATE is set to 1).
  */
hal_status_t HAL_ADF_SITF_Start(hal_adf_handle_t *hadf, hal_adf_block_index_t serial_interface_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)serial_interface_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->serial_interface_states[serial_interface_index], HAL_ADF_SITF_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hadf, serial_interface_states[serial_interface_index], HAL_ADF_SITF_STATE_IDLE,
                         HAL_ADF_SITF_STATE_ACTIVE);

  SET_BIT(ADF_GET_BLOCK(hadf, serial_interface_index)->SITFCR, ADF_SITFCR_SITFEN);

  return HAL_OK;
}

/**
  * @brief  Deactivate a specified serial interface.
  * @param  hadf                   Pointer to a hal_adf_handle_t.
  * @param  serial_interface_index Serial interface index.
  * @retval HAL_OK                 Operation completed successfully.
  */
hal_status_t HAL_ADF_SITF_Stop(hal_adf_handle_t *hadf, hal_adf_block_index_t serial_interface_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)serial_interface_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->serial_interface_states[serial_interface_index], HAL_ADF_SITF_STATE_ACTIVE);

