STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.c
  CLEAR_BIT(ADF_GET_BLOCK(hadf, serial_interface_index)->SITFCR, ADF_SITFCR_SITFEN);

  hadf->serial_interface_states[serial_interface_index] = HAL_ADF_SITF_STATE_IDLE;

  return HAL_OK;
}

/* Clock absence detection functions */
/**
  * @brief  Check clock absence detection status on a specified serial interface.
  * @param  hadf                       Pointer to a hal_adf_handle_t.
  * @param  serial_interface_index     Serial interface index.
  * @retval hal_adf_sitf_ckab_status_t Clock absence detection status.
  */
hal_adf_sitf_ckab_status_t HAL_ADF_SITF_IsClockAbsenceDetected(const hal_adf_handle_t *hadf,
                                                               hal_adf_block_index_t serial_interface_index)
{
  hal_adf_sitf_ckab_status_t status;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)serial_interface_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->serial_interface_states[serial_interface_index], HAL_ADF_SITF_STATE_ACTIVE);

  status = (IS_BIT_SET(ADF_GET_BLOCK(hadf, serial_interface_index)->DFLTISR, ADF_DFLTISR_CKABF))
           ? HAL_ADF_SITF_CKAB_DETECTED : HAL_ADF_SITF_CKAB_NOT_DETECTED;

  return status;
}

/**
  * @brief  Start clock absence detection in interrupt mode on a specified serial interface.
  * @param  hadf                   Pointer to a hal_adf_handle_t.
  * @param  serial_interface_index Serial interface index.
  * @retval HAL_OK                 Operation completed successfully.
  */
hal_status_t HAL_ADF_SITF_StartClockAbsenceDetect_IT(const hal_adf_handle_t *hadf,
                                                     hal_adf_block_index_t serial_interface_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)serial_interface_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->serial_interface_states[serial_interface_index], HAL_ADF_SITF_STATE_ACTIVE);

  SET_BIT(ADF_GET_BLOCK(hadf, serial_interface_index)->DFLTIER, ADF_DFLTIER_CKABIE);

  return HAL_OK;
}

/**
  * @brief  Stop clock absence detection in interrupt mode on a specified serial interface.
  * @param  hadf                   Pointer to a hal_adf_handle_t.
  * @param  serial_interface_index Serial interface index.
  * @retval HAL_OK                 Operation completed successfully.
  */
hal_status_t HAL_ADF_SITF_StopClockAbsenceDetect_IT(const hal_adf_handle_t *hadf,
                                                    hal_adf_block_index_t serial_interface_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)serial_interface_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->serial_interface_states[serial_interface_index], HAL_ADF_SITF_STATE_ACTIVE);

  CLEAR_BIT(ADF_GET_BLOCK(hadf, serial_interface_index)->DFLTIER, ADF_DFLTIER_CKABIE);

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup ADF_Exported_Functions_Group4
  * @{
This section provides a set of functions allowing to configure bitstream matrix:
  - Call the function HAL_ADF_BSMX_SetConfig() to configure a specified bitstream matrix.
  - Call the function HAL_ADF_BSMX_GetConfig() to get the current configuration of a specified bitstream matrix.
  */

/* Configuration functions */
/**
  * @brief  Connect a specified bitstream matrix to a specified serial interface and configure input edge.
  * @param  hadf                   Pointer to a hal_adf_handle_t.
  * @param  bitstream_matrix_index Bitstream matrix index.
  * @param  serial_interface_index Serial interface index.
  * @param  edge                   Input edge.
  * @retval HAL_OK                 Operation completed successfully.
  */
hal_status_t HAL_ADF_BSMX_SetConfig(const hal_adf_handle_t *hadf,
                                    hal_adf_block_index_t bitstream_matrix_index,
                                    hal_adf_block_index_t serial_interface_index,
                                    hal_adf_bitstream_input_edge_t edge)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)bitstream_matrix_index));
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)serial_interface_index));
  ASSERT_DBG_PARAM(IS_ADF_BSMX_INPUT_EDGE(edge));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[bitstream_matrix_index], (uint32_t)HAL_ADF_DFLT_STATE_RESET
                   | (uint32_t)HAL_ADF_DFLT_STATE_IDLE);

  MODIFY_REG(ADF_GET_BLOCK(hadf, bitstream_matrix_index)->BSMXCR, ADF_BSMXCR_BSSEL_Msk,
             ((uint32_t)serial_interface_index << 1U) | (uint32_t)edge);

  return HAL_OK;
}

/**
  * @brief Get the current serial interface connected to a specified bitstream matrix and current input edge.
  * @param hadf                     Pointer to a hal_adf_handle_t.
  * @param bitstream_matrix_index   Bitstream matrix index.
  * @param p_serial_interface_index Pointer to serial interface index.
  * @param p_edge                   Pointer to input edge.
  */
void HAL_ADF_BSMX_GetConfig(const hal_adf_handle_t *hadf,
                            hal_adf_block_index_t bitstream_matrix_index,
                            hal_adf_block_index_t *p_serial_interface_index,
                            hal_adf_bitstream_input_edge_t *p_edge)
{
  uint32_t bsmxcr_reg;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)bitstream_matrix_index));
  ASSERT_DBG_PARAM(p_serial_interface_index != NULL);
  ASSERT_DBG_PARAM(p_edge != NULL);

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);

  bsmxcr_reg = READ_REG(ADF_GET_BLOCK(hadf, bitstream_matrix_index)->BSMXCR);
  *p_serial_interface_index = (hal_adf_block_index_t)(uint32_t)((bsmxcr_reg & ADF_BSMXCR_BSSEL_Msk) >> 1U);
  *p_edge = (hal_adf_bitstream_input_edge_t)(uint32_t)(bsmxcr_reg & 1U);
}

/**
  * @}
  */

/** @addtogroup ADF_Exported_Functions_Group5
  * @{
This section provides a set of functions allowing to configure digital filter:
  - Call the function HAL_ADF_DFLT_SetConfig() to configure a specified digital filter.
  - Call the function HAL_ADF_DFLT_GetConfig() to get current configuration of a specified digital filter.
  - Call the function HAL_ADF_DFLT_SetSamplesDelay() to set samples delay on a specified digital filter.
  - Call the function HAL_ADF_DFLT_GetSamplesDelay() to get current samples delay on a specified digital filter.
  - Call the function HAL_ADF_DFLT_SetGain() to set gain on a specified digital filter.
  - Call the function HAL_ADF_DFLT_GetGain() to get current gain on a specified digital filter.
  - Call the function HAL_ADF_DFLT_SetFifoThreshold() to set FIFO threshold on a specified digital filter.
  - Call the function HAL_ADF_DFLT_GetFifoThreshold() to get current FIFO threshold on a specified digital filter.
  - Call the function HAL_ADF_DFLT_SetDiscardSamples() to set discard samples on a specified digital filter.
  - Call the function HAL_ADF_DFLT_GetDiscardSamples() to get current discard samples on a specified digital filter.

