STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.c
This section provides also a set of functions allowing to control digital filter:
  - Call the function HAL_ADF_DFLT_EnableReshapeFilter() to enable reshape filter on a specified digital filter.
  - Call the function HAL_ADF_DFLT_DisableReshapeFilter() to disable reshape filter on a specified digital filter.
  - Call the function HAL_ADF_DFLT_IsEnabledReshapeFilter() to check reshape filter status on a specified
    digital filter.
  - Call the function HAL_ADF_DFLT_GetReshapeFilterDecimationRatio() to get current reshape filter decimation ratio
    on a specified digital filter.
  - Call the function HAL_ADF_DFLT_EnableHighPassFilter() to enable high-pass filter on a specified digital filter.
  - Call the function HAL_ADF_DFLT_DisableHighPassFilter() to disable high-pass filter on a specified digital filter.
  - Call the function HAL_ADF_DFLT_IsEnabledHighPassFilter() to check high-pass filter status on a specified
    digital filter.
  - Call the function HAL_ADF_DFLT_GetHighPassFilterCutOffFrequency() to get current high-pass filter cut-off frequency
    on a specified digital filter.

This section provides also a set of functions allowing to process digital filter:
  - Call the function HAL_ADF_DFLT_StartAcq() to start acquisition on a specified digital filter in polling mode.
  - Call the function HAL_ADF_DFLT_StopAcq() to stop acquisition on a specified digital filter in polling mode.
  - Call the function HAL_ADF_DFLT_PollForAcq() to wait available acquisition on a specified digital filter
    in polling mode.
  - Call the function HAL_ADF_DFLT_GetAcqValue() to get acquisition value on a specified digital filter.
  - Call the function HAL_ADF_DFLT_StartAcq_IT() to start acquisition on a specified digital filter in interrupt mode.
  - Call the function HAL_ADF_DFLT_StopAcq_IT() to stop acquisition on a specified digital filter in interrupt mode.
  - Call the function HAL_ADF_DFLT_StartAcq_IT_Opt() to start acquisition on a specified digital filter
    in interrupt mode with optional interruptions.
  - Call the function HAL_ADF_DFLT_StartAcq_DMA() to start acquisition on a specified digital filter in DMA mode.
  - Call the function HAL_ADF_DFLT_StopAcq_DMA() to stop acquisition on a specified digital filter in DMA mode.
  - Call the function HAL_ADF_DFLT_StartAcq_DMA_Opt() to start acquisition on a specified digital filter
    in DMA mode with optional interruptions.
  */

/* Configuration functions */
/**
  * @brief  Configure a specified digital filter.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @param  p_config             Pointer to digital filter configuration structure.
  * @retval HAL_OK               Operation completed successfully.
  * @retval HAL_INVALID_PARAM    Pointer to digital filter configuration structure is NULL.
  */
hal_status_t HAL_ADF_DFLT_SetConfig(hal_adf_handle_t *hadf,
                                    hal_adf_block_index_t digital_filter_index,
                                    const hal_adf_digital_filter_config_t *p_config)
{
  ADF_Block_TypeDef *p_adf_block;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));
  ASSERT_DBG_PARAM(p_config != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_ADF_DFLT_DATA_SOURCE(p_config->data_source));
  ASSERT_DBG_PARAM(IS_ADF_DFLT_CIC_MODE(p_config->cic_mode));
  ASSERT_DBG_PARAM(IS_ADF_DFLT_DECIMATION_RATIO(p_config->decimation_ratio));
  ASSERT_DBG_PARAM(IS_ADF_DFLT_GAIN(p_config->gain));
  ASSERT_DBG_PARAM(IS_ADF_DFLT_ACQUISITION_MODE(p_config->acquisition_mode));
  ASSERT_DBG_PARAM(IS_ADF_DFLT_TRIGGER_SOURCE(p_config->trigger.source));
  ASSERT_DBG_PARAM(IS_ADF_DFLT_TRIGGER_EDGE(p_config->trigger.edge));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], (uint32_t)HAL_ADF_DFLT_STATE_RESET
                   | (uint32_t)HAL_ADF_DFLT_STATE_IDLE);

  p_adf_block = ADF_GET_BLOCK(hadf, digital_filter_index);
  MODIFY_REG(p_adf_block->DFLTCICR, ADF_DFLTCICR_DATSRC_Msk | ADF_DFLTCICR_CICMOD_Msk | ADF_DFLTCICR_MCICD_Msk
             | ADF_DFLTCICR_SCALE_Msk, (uint32_t)p_config->data_source | (uint32_t)p_config->cic_mode
             | ((p_config->decimation_ratio - 1U) << ADF_DFLTCICR_MCICD_Pos)
             | (ADF_AdjustGainToRegisterValue(p_config->gain) << ADF_DFLTCICR_SCALE_Pos));
  MODIFY_REG(p_adf_block->DFLTCR, ADF_DFLTCR_ACQMOD_Msk | ADF_DFLTCR_TRGSENS_Msk | ADF_DFLTCR_TRGSRC_Msk,
             (uint32_t)p_config->acquisition_mode | (uint32_t)p_config->trigger.edge
             | (uint32_t)p_config->trigger.source);

  hadf->digital_filter_states[digital_filter_index] = HAL_ADF_DFLT_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Get current configuration of a specified digital filter.
  * @param hadf                 Pointer to a hal_adf_handle_t.
  * @param digital_filter_index Digital filter index.
  * @param p_config             Pointer to digital filter configuration structure.
  */
void HAL_ADF_DFLT_GetConfig(const hal_adf_handle_t *hadf,
                            hal_adf_block_index_t digital_filter_index,
                            hal_adf_digital_filter_config_t *p_config)
{
  const ADF_Block_TypeDef *p_adf_block;
  uint32_t reg;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));
  ASSERT_DBG_PARAM(p_config != NULL);

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], (uint32_t)HAL_ADF_DFLT_STATE_IDLE
                   | (uint32_t)HAL_ADF_DFLT_STATE_ACTIVE);

  p_adf_block = ADF_GET_BLOCK(hadf, digital_filter_index);
  reg = READ_REG(p_adf_block->DFLTCICR);
  p_config->data_source = (hal_adf_dflt_data_source_t)(uint32_t)(reg & ADF_DFLTCICR_DATSRC_Msk);
  p_config->cic_mode = (hal_adf_dflt_cic_mode_t)(uint32_t)(reg & ADF_DFLTCICR_CICMOD_Msk);
  p_config->decimation_ratio = ((reg & ADF_DFLTCICR_MCICD_Msk) >> ADF_DFLTCICR_MCICD_Pos) + 1U;
  p_config->gain = ADF_AdjustGainFromRegisterValue((reg & ADF_DFLTCICR_SCALE_Msk) >> ADF_DFLTCICR_SCALE_Pos);
  reg = READ_REG(p_adf_block->DFLTCR);
  p_config->acquisition_mode = (hal_adf_dflt_acquisition_mode_t)(uint32_t)(reg & ADF_DFLTCR_ACQMOD_Msk);
  p_config->trigger.source = (hal_adf_dflt_trigger_source_t)(uint32_t)(reg & ADF_DFLTCR_TRGSRC_Msk);
  p_config->trigger.edge = (hal_adf_dflt_trigger_edge_t)(uint32_t)(reg & ADF_DFLTCR_TRGSENS_Msk);
}

/**
  * @brief  Set samples delay on a specified digital filter.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @param  samples_delay        Samples delay.
  *                              This parameter must be a number between Min_Data = 0 and Max_Data = 127.
  * @retval HAL_OK               Operation completed successfully.
  */
hal_status_t HAL_ADF_DFLT_SetSamplesDelay(const hal_adf_handle_t *hadf,
                                          hal_adf_block_index_t digital_filter_index,
                                          uint32_t samples_delay)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));
  ASSERT_DBG_PARAM(IS_ADF_DFLT_SAMPLES_DELAY(samples_delay));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], (uint32_t)HAL_ADF_DFLT_STATE_IDLE
                   | (uint32_t)HAL_ADF_DFLT_STATE_ACTIVE);

  MODIFY_REG(ADF_GET_BLOCK(hadf, digital_filter_index)->DLYCR, ADF_DLYCR_SKPDLY_Msk, samples_delay);

  return HAL_OK;
}

/**
  * @brief  Get current samples delay on a specified digital filter.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @retval uint32_t             Samples delay.
  */
uint32_t HAL_ADF_DFLT_GetSamplesDelay(const hal_adf_handle_t *hadf,
                                      hal_adf_block_index_t digital_filter_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], (uint32_t)HAL_ADF_DFLT_STATE_IDLE
                   | (uint32_t)HAL_ADF_DFLT_STATE_ACTIVE);

