STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.c
  return (READ_BIT(ADF_GET_BLOCK(hadf, digital_filter_index)->DLYCR, ADF_DLYCR_SKPDLY_Msk));
}

/**
  * @brief  Set gain on a specified digital filter.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @param  gain                 Gain in step of around 3db (from -48db to 72dB).
  *                              This parameter must be a number between Min_Data = -16 and Max_Data = 24.
  * @retval HAL_OK               Operation completed successfully.
  */
hal_status_t HAL_ADF_DFLT_SetGain(const hal_adf_handle_t *hadf,
                                  hal_adf_block_index_t digital_filter_index,
                                  int32_t gain)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));
  ASSERT_DBG_PARAM(IS_ADF_DFLT_GAIN(gain));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], (uint32_t)HAL_ADF_DFLT_STATE_IDLE
                   | (uint32_t)HAL_ADF_DFLT_STATE_ACTIVE);

  MODIFY_REG(ADF_GET_BLOCK(hadf, digital_filter_index)->DFLTCICR, ADF_DFLTCICR_SCALE_Msk,
             (ADF_AdjustGainToRegisterValue(gain) << ADF_DFLTCICR_SCALE_Pos));

  return HAL_OK;
}

/**
  * @brief  Get current gain on a specified digital filter.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @retval int32_t              Gain in step of around 3db (from -48db to 72dB).
  *                              This parameter is a number between Min_Data = -16 and Max_Data = 24.
  */
int32_t HAL_ADF_DFLT_GetGain(const hal_adf_handle_t *hadf,
                             hal_adf_block_index_t digital_filter_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], (uint32_t)HAL_ADF_DFLT_STATE_IDLE
                   | (uint32_t)HAL_ADF_DFLT_STATE_ACTIVE);

  return ADF_AdjustGainFromRegisterValue((READ_REG(ADF_GET_BLOCK(hadf, digital_filter_index)->DFLTCICR)
                                          & ADF_DFLTCICR_SCALE_Msk) >> ADF_DFLTCICR_SCALE_Pos);
}

/**
  * @brief  Set FIFO threshold on a specified digital filter.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @param  fifo_threshold       FIFO threshold.
  * @retval HAL_OK               Operation completed successfully.
  */
hal_status_t HAL_ADF_DFLT_SetFifoThreshold(const hal_adf_handle_t *hadf,
                                           hal_adf_block_index_t digital_filter_index,
                                           hal_adf_dflt_fifo_threshold_t fifo_threshold)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));
  ASSERT_DBG_PARAM(IS_ADF_DFLT_FIFO_THRESHOLD(fifo_threshold));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_IDLE);

  MODIFY_REG(ADF_GET_BLOCK(hadf, digital_filter_index)->DFLTCR, ADF_DFLTCR_FTH_Msk, (uint32_t)fifo_threshold);

  return HAL_OK;
}

/**
  * @brief  Get current FIFO threshold on a specified digital filter.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index          Digital filter index.
  * @retval hal_adf_dflt_fifo_threshold_t FIFO threshold.
  */
hal_adf_dflt_fifo_threshold_t HAL_ADF_DFLT_GetFifoThreshold(const hal_adf_handle_t *hadf,
                                                            hal_adf_block_index_t digital_filter_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], (uint32_t)HAL_ADF_DFLT_STATE_IDLE
                   | (uint32_t)HAL_ADF_DFLT_STATE_ACTIVE);

  return (hal_adf_dflt_fifo_threshold_t)(uint32_t)READ_BIT(ADF_GET_BLOCK(hadf, digital_filter_index)->DFLTCR,
                                                           ADF_DFLTCR_FTH_Msk);
}

/**
  * @brief  Set discard samples on a specified digital filter.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @param  discard_samples      Discard samples.
  *                              This parameter must be a number between Min_Data = 0 and Max_Data = 255.
  * @retval HAL_OK               Operation completed successfully.
  */
hal_status_t HAL_ADF_DFLT_SetDiscardSamples(const hal_adf_handle_t *hadf,
                                            hal_adf_block_index_t digital_filter_index,
                                            uint32_t discard_samples)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));
  ASSERT_DBG_PARAM(IS_ADF_DFLT_DISCARD_SAMPLES(discard_samples));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_IDLE);

  MODIFY_REG(ADF_GET_BLOCK(hadf, digital_filter_index)->DFLTCR, ADF_DFLTCR_NBDIS_Msk,
             discard_samples << ADF_DFLTCR_NBDIS_Pos);

  return HAL_OK;
}

/**
  * @brief  Get current discard samples on a specified digital filter.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @retval uint32_t             Discard samples.
  */
uint32_t HAL_ADF_DFLT_GetDiscardSamples(const hal_adf_handle_t *hadf,
                                        hal_adf_block_index_t digital_filter_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], (uint32_t)HAL_ADF_DFLT_STATE_IDLE
                   | (uint32_t)HAL_ADF_DFLT_STATE_ACTIVE);

  return (READ_BIT(ADF_GET_BLOCK(hadf, digital_filter_index)->DFLTCR, ADF_DFLTCR_NBDIS_Msk) >> ADF_DFLTCR_NBDIS_Pos);
}

/* Control functions */
/**
  * @brief  Enable reshape filter on a specified digital filter.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @param  decimation_ratio     Reshape filter decimation ratio.
  * @retval HAL_OK               Operation completed successfully.
  */
hal_status_t HAL_ADF_DFLT_EnableReshapeFilter(const hal_adf_handle_t *hadf,
                                              hal_adf_block_index_t digital_filter_index,
                                              hal_adf_dflt_rsf_decimation_ratio_t decimation_ratio)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));
  ASSERT_DBG_PARAM(IS_ADF_DFLT_RSF_DECIMATION_RATIO(decimation_ratio));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_IDLE);

  MODIFY_REG(ADF_GET_BLOCK(hadf, digital_filter_index)->DFLTRSFR, ADF_DFLTRSFR_RSFLTBYP_Msk | ADF_DFLTRSFR_RSFLTD_Msk,
             (uint32_t)decimation_ratio);

  return HAL_OK;
}

/**
  * @brief  Disable reshape filter on a specified digital filter.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @retval HAL_OK               Operation completed successfully.
  */
hal_status_t HAL_ADF_DFLT_DisableReshapeFilter(const hal_adf_handle_t *hadf,
                                               hal_adf_block_index_t digital_filter_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_IDLE);

  SET_BIT(ADF_GET_BLOCK(hadf, digital_filter_index)->DFLTRSFR, ADF_DFLTRSFR_RSFLTBYP);

  return HAL_OK;
}

/**
  * @brief  Check reshape filter status on a specified digital filter.
  * @param  hadf                      Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index      Digital filter index.
  * @retval hal_adf_dflt_rsf_status_t Reshape filter status.
  */
hal_adf_dflt_rsf_status_t HAL_ADF_DFLT_IsEnabledReshapeFilter(const hal_adf_handle_t *hadf,
                                                              hal_adf_block_index_t digital_filter_index)
{
  hal_adf_dflt_rsf_status_t status;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], (uint32_t)HAL_ADF_DFLT_STATE_IDLE
                   | (uint32_t)HAL_ADF_DFLT_STATE_ACTIVE);

  status = (IS_BIT_SET(ADF_GET_BLOCK(hadf, digital_filter_index)->DFLTRSFR, ADF_DFLTRSFR_RSFLTBYP))
           ? HAL_ADF_DFLT_RSF_DISABLED : HAL_ADF_DFLT_RSF_ENABLED;

