STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.c
  return status;
}

/**
  * @brief  Get current reshape filter decimation ratio on a specified digital filter.
  * @param  hadf                                Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index                Digital filter index.
  * @retval hal_adf_dflt_rsf_decimation_ratio_t Reshape filter decimation ratio.
  */
hal_adf_dflt_rsf_decimation_ratio_t HAL_ADF_DFLT_GetReshapeFilterDecimationRatio(const hal_adf_handle_t *hadf,
    hal_adf_block_index_t digital_filter_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], (uint32_t)HAL_ADF_DFLT_STATE_IDLE
                   | (uint32_t)HAL_ADF_DFLT_STATE_ACTIVE);

  return (hal_adf_dflt_rsf_decimation_ratio_t)(uint32_t)READ_BIT(ADF_GET_BLOCK(hadf, digital_filter_index)->DFLTRSFR,
                                                                 ADF_DFLTRSFR_RSFLTD_Msk);
}

/**
  * @brief  Enable high-pass filter on a specified digital filter.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @param  cut_off_frequency    High-pass filter cut-off frequency.
  * @retval HAL_OK               Operation completed successfully.
  */
hal_status_t HAL_ADF_DFLT_EnableHighPassFilter(const hal_adf_handle_t *hadf,
                                               hal_adf_block_index_t digital_filter_index,
                                               hal_adf_dflt_hpf_cut_off_frequency_t cut_off_frequency)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));
  ASSERT_DBG_PARAM(IS_ADF_DFLT_HPF_CUT_OFF_FREQUENCY(cut_off_frequency));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_IDLE);

  MODIFY_REG(ADF_GET_BLOCK(hadf, digital_filter_index)->DFLTRSFR, ADF_DFLTRSFR_HPFBYP_Msk | ADF_DFLTRSFR_HPFC_Msk,
             (uint32_t)cut_off_frequency);

  return HAL_OK;
}

/**
  * @brief  Disable high-pass filter on a specified digital filter.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @retval HAL_OK               Operation completed successfully.
  */
hal_status_t HAL_ADF_DFLT_DisableHighPassFilter(const hal_adf_handle_t *hadf,
                                                hal_adf_block_index_t digital_filter_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_IDLE);

  SET_BIT(ADF_GET_BLOCK(hadf, digital_filter_index)->DFLTRSFR, ADF_DFLTRSFR_HPFBYP);

  return HAL_OK;
}

/**
  * @brief  Check high-pass filter status on a specified digital filter.
  * @param  hadf                      Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index      Digital filter index.
  * @retval hal_adf_dflt_hpf_status_t High-pass filter status.
  */
hal_adf_dflt_hpf_status_t HAL_ADF_DFLT_IsEnabledHighPassFilter(const hal_adf_handle_t *hadf,
                                                               hal_adf_block_index_t digital_filter_index)
{
  hal_adf_dflt_hpf_status_t status;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], (uint32_t)HAL_ADF_DFLT_STATE_IDLE
                   | (uint32_t)HAL_ADF_DFLT_STATE_ACTIVE);

  status = (IS_BIT_SET(ADF_GET_BLOCK(hadf, digital_filter_index)->DFLTRSFR, ADF_DFLTRSFR_HPFBYP))
           ? HAL_ADF_DFLT_HPF_DISABLED : HAL_ADF_DFLT_HPF_ENABLED;

  return status;
}

/**
  * @brief  Get current high-pass filter cut-off frequency on a specified digital filter.
  * @param  hadf                                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index                 Digital filter index.
  * @retval hal_adf_dflt_hpf_cut_off_frequency_t High-pass filter cut-off frequency.
  */
hal_adf_dflt_hpf_cut_off_frequency_t HAL_ADF_DFLT_GetHighPassFilterCutOffFrequency(const hal_adf_handle_t *hadf,
    hal_adf_block_index_t digital_filter_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], (uint32_t)HAL_ADF_DFLT_STATE_IDLE
                   | (uint32_t)HAL_ADF_DFLT_STATE_ACTIVE);

  return (hal_adf_dflt_hpf_cut_off_frequency_t)(uint32_t)READ_BIT(ADF_GET_BLOCK(hadf, digital_filter_index)->DFLTRSFR,
                                                                  ADF_DFLTRSFR_HPFC_Msk);
}

/* Process functions */
/**
  * @brief  Start acquisition on a specified digital filter in polling mode.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @retval HAL_OK               Operation completed successfully.
  * @retval HAL_BUSY             The digital filter state is not HAL_ADF_DFLT_STATE_IDLE
  *                              (USE_HAL_CHECK_PROCESS_STATE is set to 1).
  */
hal_status_t HAL_ADF_DFLT_StartAcq(hal_adf_handle_t *hadf,
                                   hal_adf_block_index_t digital_filter_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hadf, digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_IDLE,
                         HAL_ADF_DFLT_STATE_ACTIVE);

  SET_BIT(ADF_GET_BLOCK(hadf, digital_filter_index)->DFLTCR, ADF_DFLTCR_DFLTEN);

  return HAL_OK;
}

/**
  * @brief  Stop acquisition on a specified digital filter in polling mode.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @retval HAL_OK               Operation completed successfully.
  */
hal_status_t HAL_ADF_DFLT_StopAcq(hal_adf_handle_t *hadf,
                                  hal_adf_block_index_t digital_filter_index)
{
  ADF_Block_TypeDef *p_adf_block;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_ACTIVE);

  /* Deactivate digital filter and clear potential pending flags */
  p_adf_block = ADF_GET_BLOCK(hadf, digital_filter_index);
  CLEAR_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DFLTEN);
  WRITE_REG(p_adf_block->DFLTISR, (ADF_DFLTISR_DOVRF | ADF_DFLTISR_SATF | ADF_DFLTISR_RFOVRF));

  hadf->digital_filter_states[digital_filter_index] = HAL_ADF_DFLT_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Wait available acquisition on a specified digital filter in polling mode.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @param  timeout_ms           Acquisition timeout value.
  * @retval HAL_OK               Operation completed successfully.
  * @retval HAL_TIMEOUT          Operation exceeds user timeout.
  */
hal_status_t HAL_ADF_DFLT_PollForAcq(hal_adf_handle_t *hadf,
                                     hal_adf_block_index_t digital_filter_index,
                                     uint32_t timeout_ms)
{
  ADF_Block_TypeDef *p_adf_block;
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_ACTIVE);

  tickstart = HAL_GetTick();

  /* Check if an acquisition is available */
  p_adf_block = ADF_GET_BLOCK(hadf, digital_filter_index);
  while (IS_BIT_CLR(p_adf_block->DFLTISR, ADF_DFLTISR_RXNEF))
  {
    /* Check for the timeout */
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        return HAL_TIMEOUT;
      }
    }
  }

  /* If acquisition mode is asynchronous single shot, set digital filter state to idle */
  if (READ_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_ACQMOD_Msk) == (uint32_t)HAL_ADF_DFLT_ACQ_MODE_ASYNC_SINGLE)
  {
    /* Deactivate digital filter and clear potential pending flags */
    CLEAR_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DFLTEN);
    WRITE_REG(p_adf_block->DFLTISR, (ADF_DFLTISR_DOVRF | ADF_DFLTISR_SATF | ADF_DFLTISR_RFOVRF));

    hadf->digital_filter_states[digital_filter_index] = HAL_ADF_DFLT_STATE_IDLE;
  }

  return HAL_OK;
}

/**
  * @brief  Get acquisition value on a specified digital filter.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @retval int32_t              Acquisition value.
  */
int32_t HAL_ADF_DFLT_GetAcqValue(const hal_adf_handle_t *hadf,
                                 hal_adf_block_index_t digital_filter_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], (uint32_t)HAL_ADF_DFLT_STATE_IDLE
                   | (uint32_t)HAL_ADF_DFLT_STATE_ACTIVE);

  return (int32_t) READ_BIT(ADF_GET_BLOCK(hadf, digital_filter_index)->DFLTDR, ADF_DFLTDR_DR_Msk);
}

/**
  * @brief  Start acquisition on a specified digital filter in interrupt mode.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @retval HAL_OK               Operation completed successfully.
  * @retval HAL_BUSY             The digital filter state is not HAL_ADF_DFLT_STATE_IDLE
  *                              (USE_HAL_CHECK_PROCESS_STATE is set to 1).
  */
hal_status_t HAL_ADF_DFLT_StartAcq_IT(hal_adf_handle_t *hadf,
                                      hal_adf_block_index_t digital_filter_index)
{
  ADF_Block_TypeDef *p_adf_block;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_IDLE);

