STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.c
  HAL_CHECK_UPDATE_STATE(hadf, digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_IDLE,
                         HAL_ADF_DFLT_STATE_ACTIVE);

  /* Enable all acquisition interruptions */
  p_adf_block = ADF_GET_BLOCK(hadf, digital_filter_index);
  ADF_DFLT_EnableInterruptions(p_adf_block);

  /* Activate digital filter */
  SET_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DFLTEN);

  return HAL_OK;
}

/**
  * @brief  Stop acquisition on a specified digital filter in interrupt mode.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @retval HAL_OK               Operation completed successfully.
  */
hal_status_t HAL_ADF_DFLT_StopAcq_IT(hal_adf_handle_t *hadf,
                                     hal_adf_block_index_t digital_filter_index)
{
  ADF_Block_TypeDef *p_adf_block;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_ACTIVE);

  /* Deactivate digital filter */
  p_adf_block = ADF_GET_BLOCK(hadf, digital_filter_index);
  CLEAR_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DFLTEN);

  /* Disable all acquisition interruptions */
  CLEAR_BIT(p_adf_block->DFLTIER, ADF_DFLTIER_FTHIE | ADF_DFLTIER_DOVRIE | ADF_DFLTIER_SATIE | ADF_DFLTIER_RFOVRIE);

  /* Clear potential pending flags */
  WRITE_REG(p_adf_block->DFLTISR, (ADF_DFLTISR_DOVRF | ADF_DFLTISR_SATF | ADF_DFLTISR_RFOVRF));

  hadf->digital_filter_states[digital_filter_index] = HAL_ADF_DFLT_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Start acquisition on a specified digital filter in interrupt mode with optional interruptions.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @param  interruptions        Optional interruptions.
  *                              This parameter must be a combination of the following values:
  *                                @arg @ref HAL_ADF_DFLT_OPT_IT_NONE
  *                                @arg @ref HAL_ADF_DFLT_OPT_IT_ACQ_OVR
  *                                @arg @ref HAL_ADF_DFLT_OPT_IT_RSF_OVR
  *                                @arg @ref HAL_ADF_DFLT_OPT_IT_SAT
  *                                @arg @ref HAL_ADF_DFLT_OPT_IT_DEFAULT
  * @retval HAL_OK               Operation completed successfully.
  * @retval HAL_BUSY             The digital filter state is not HAL_ADF_DFLT_STATE_IDLE
  *                              (USE_HAL_CHECK_PROCESS_STATE is set to 1).
  */
hal_status_t HAL_ADF_DFLT_StartAcq_IT_Opt(hal_adf_handle_t *hadf,
                                          hal_adf_block_index_t digital_filter_index,
                                          uint32_t interruptions)
{
  ADF_Block_TypeDef *p_adf_block;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));
  ASSERT_DBG_PARAM(IS_ADF_DFLT_OPTIONAL_IT(interruptions));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hadf, digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_IDLE,
                         HAL_ADF_DFLT_STATE_ACTIVE);

  /* Enable only acquisition complete and specified optional interruptions */
  p_adf_block = ADF_GET_BLOCK(hadf, digital_filter_index);
  ADF_DFLT_EnableInterruptions_Opt(p_adf_block, interruptions);

  /* Activate digital filter */
  SET_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DFLTEN);

  return HAL_OK;
}

#if defined (USE_HAL_ADF_DMA) && (USE_HAL_ADF_DMA == 1)
/**
  * @brief  Start acquisition on a specified digital filter in DMA mode.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @param  p_dma_config         Pointer to DMA configuration structure.
  * @retval HAL_OK               Operation completed successfully.
  * @retval HAL_ERROR            Operation error.
  * @retval HAL_INVALID_PARAM    Pointer to DMA configuration structure is NULL.
  * @retval HAL_BUSY             The digital filter state is not HAL_ADF_DFLT_STATE_IDLE
  *                              (USE_HAL_CHECK_PROCESS_STATE is set to 1).
  */
hal_status_t HAL_ADF_DFLT_StartAcq_DMA(hal_adf_handle_t *hadf,
                                       hal_adf_block_index_t digital_filter_index,
                                       const hal_adf_dma_config_t *p_dma_config)
{
  hal_status_t status = HAL_ERROR;
  ADF_Block_TypeDef *p_adf_block;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));
  ASSERT_DBG_PARAM(p_dma_config != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_dma_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(p_dma_config->data_length_byte != 0U);
  ASSERT_DBG_PARAM(IS_ADF_DFLT_DMA_DATA_RESOLUTION(p_dma_config->data_resolution));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hadf, digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_IDLE,
                         HAL_ADF_DFLT_STATE_ACTIVE);

  p_adf_block = ADF_GET_BLOCK(hadf, digital_filter_index);
  if (hadf->hdma[digital_filter_index] != NULL)
  {
    uint32_t src_address;

    /* Set DMA callbacks on DMA handle */
    hadf->hdma[digital_filter_index]->p_xfer_halfcplt_cb = ADF_DFLT_DMA_HalfCplt;
    hadf->hdma[digital_filter_index]->p_xfer_cplt_cb = ADF_DFLT_DMA_Cplt;
    hadf->hdma[digital_filter_index]->p_xfer_error_cb = ADF_DFLT_DMA_Error;

    src_address = (p_dma_config->data_resolution == HAL_ADF_DMA_DATA_RESOLUTION_MSB_ONLY) ?
                  (((uint32_t)&p_adf_block->DFLTDR) + 2U) : (uint32_t)&p_adf_block->DFLTDR;


    status = HAL_DMA_StartPeriphXfer_IT_Opt(hadf->hdma[digital_filter_index], src_address, p_dma_config->address,
                                            p_dma_config->data_length_byte, HAL_DMA_OPT_IT_HT);
  }

  if (status == HAL_OK)
  {
    /* Enable all acquisition interruptions */
    ADF_DFLT_EnableInterruptions(p_adf_block);

    /* Enable DMA request */
    SET_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DMAEN);

    /* Activate digital filter */
    SET_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DFLTEN);
  }
  else
  {
#if defined (USE_HAL_ADF_GET_LAST_ERRORS) && (USE_HAL_ADF_GET_LAST_ERRORS == 1)
    hadf->last_error_codes[digital_filter_index] |= HAL_ADF_ERROR_DMA;
#endif /* USE_HAL_ADF_GET_LAST_ERRORS */

    hadf->digital_filter_states[digital_filter_index] = HAL_ADF_DFLT_STATE_IDLE;
  }

