STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.c
  return status;
}

/**
  * @brief  Stop acquisition on a specified digital filter in DMA mode.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @retval HAL_OK               Operation completed successfully.
  */
hal_status_t HAL_ADF_DFLT_StopAcq_DMA(hal_adf_handle_t *hadf,
                                      hal_adf_block_index_t digital_filter_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_ACTIVE);

  hadf->hdma[digital_filter_index]->p_xfer_abort_cb = ADF_DFLT_DMA_Abort;
  if (HAL_DMA_Abort_IT(hadf->hdma[digital_filter_index]) != HAL_OK)
  {
    ADF_Block_TypeDef *p_adf_block;

    /* Deactivate digital filter */
    p_adf_block = ADF_GET_BLOCK(hadf, digital_filter_index);
    CLEAR_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DFLTEN);

    /* Disable all acquisition interruptions */
    CLEAR_BIT(p_adf_block->DFLTIER, ADF_DFLTIER_FTHIE | ADF_DFLTIER_DOVRIE | ADF_DFLTIER_SATIE | ADF_DFLTIER_RFOVRIE);

    /* Clear potential pending flags */
    WRITE_REG(p_adf_block->DFLTISR, (ADF_DFLTISR_DOVRF | ADF_DFLTISR_SATF | ADF_DFLTISR_RFOVRF));

    /* Disable DMA request */
    CLEAR_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DMAEN);

    hadf->digital_filter_states[digital_filter_index] = HAL_ADF_DFLT_STATE_IDLE;

#if defined(USE_HAL_ADF_REGISTER_CALLBACKS) && (USE_HAL_ADF_REGISTER_CALLBACKS == 1)
    hadf->p_acquisition_stop_cb(hadf, digital_filter_index);
#else
    HAL_ADF_DFLT_AcqStopCpltCallback(hadf, digital_filter_index);
#endif /* USE_HAL_ADF_REGISTER_CALLBACKS */
  }

  return HAL_OK;
}

/**
  * @brief  Start acquisition on a specified digital filter in DMA mode with optional interruptions.
  * @param  hadf                 Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index Digital filter index.
  * @param  p_dma_config         Pointer to DMA configuration structure.
  * @param  interruptions        Optional interruptions.
  *                              This parameter must be a combination of the following values:
  *                                @arg @ref HAL_ADF_DFLT_OPT_IT_NONE
  *                                @arg @ref HAL_ADF_DFLT_OPT_IT_ACQ_OVR
  *                                @arg @ref HAL_ADF_DFLT_OPT_IT_RSF_OVR
  *                                @arg @ref HAL_ADF_DFLT_OPT_IT_SAT
  *                                @arg @ref HAL_ADF_DFLT_OPT_IT_DEFAULT
  * @retval HAL_OK               Operation completed successfully.
  * @retval HAL_ERROR            Operation error.
  * @retval HAL_INVALID_PARAM    Pointer to DMA configuration structure is NULL.
  * @retval HAL_BUSY             The digital filter state is not HAL_ADF_DFLT_STATE_IDLE
  *                              (USE_HAL_CHECK_PROCESS_STATE is set to 1).
  */
hal_status_t HAL_ADF_DFLT_StartAcq_DMA_Opt(hal_adf_handle_t *hadf,
                                           hal_adf_block_index_t digital_filter_index,
                                           const hal_adf_dma_config_t *p_dma_config,
                                           uint32_t interruptions)
{
  hal_status_t status = HAL_ERROR;
  ADF_Block_TypeDef *p_adf_block;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));
  ASSERT_DBG_PARAM(p_dma_config != NULL);
  ASSERT_DBG_PARAM(IS_ADF_DFLT_OPTIONAL_IT(interruptions));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_dma_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(p_dma_config->data_length_byte != 0U);
  ASSERT_DBG_PARAM(IS_ADF_DFLT_DMA_DATA_RESOLUTION(p_dma_config->data_resolution));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hadf, digital_filter_states[digital_filter_index], HAL_ADF_DFLT_STATE_IDLE,
                         HAL_ADF_DFLT_STATE_ACTIVE);

  p_adf_block = ADF_GET_BLOCK(hadf, digital_filter_index);
  if (hadf->hdma[digital_filter_index] != NULL)
  {
    uint32_t src_address;

    /* Set DMA callbacks on DMA handle */
    hadf->hdma[digital_filter_index]->p_xfer_halfcplt_cb = ADF_DFLT_DMA_HalfCplt;
    hadf->hdma[digital_filter_index]->p_xfer_cplt_cb = ADF_DFLT_DMA_Cplt;
    hadf->hdma[digital_filter_index]->p_xfer_error_cb = ADF_DFLT_DMA_Error;

    src_address = (p_dma_config->data_resolution == HAL_ADF_DMA_DATA_RESOLUTION_MSB_ONLY) ?
                  (((uint32_t)&p_adf_block->DFLTDR) + 2U) : (uint32_t)&p_adf_block->DFLTDR;


    status = HAL_DMA_StartPeriphXfer_IT_Opt(hadf->hdma[digital_filter_index], src_address, p_dma_config->address,
                                            p_dma_config->data_length_byte, HAL_DMA_OPT_IT_HT);
  }

  if (status == HAL_OK)
  {
    /* Enable only acquisition complete and specified optional interruptions */
    ADF_DFLT_EnableInterruptions_Opt(p_adf_block, interruptions);

    /* Enable DMA request */
    SET_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DMAEN);

    /* Activate digital filter */
    SET_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DFLTEN);
  }
  else
  {
#if defined (USE_HAL_ADF_GET_LAST_ERRORS) && (USE_HAL_ADF_GET_LAST_ERRORS == 1)
    hadf->last_error_codes[digital_filter_index] |= HAL_ADF_ERROR_DMA;
#endif /* USE_HAL_ADF_GET_LAST_ERRORS */

    hadf->digital_filter_states[digital_filter_index] = HAL_ADF_DFLT_STATE_IDLE;
  }

  return status;
}
#endif /* USE_HAL_ADF_DMA */

/**
  * @}
  */

/** @addtogroup ADF_Exported_Functions_Group6
  * @{
This section provides a set of functions allowing to configure sound activity detector:
  - Call the function HAL_ADF_SAD_SetConfig() to configure a specified sound activity detector.
  - Call the function HAL_ADF_SAD_GetConfig() to get the current configuration of a specified sound activity detector.
  - Call the function HAL_ADF_SAD_SetFrameSize() to set frame size on a specified sound activity detector.
  - Call the function HAL_ADF_SAD_GetFrameSize() to get current frame size on a specified sound activity detector.
  - Call the function HAL_ADF_SAD_SetLearningFrames() to set learning frames on a specified sound activity detector.
  - Call the function HAL_ADF_SAD_GetLearningFrames() to get current learning frames on a specified sound activity
    detector.
  - Call the function HAL_ADF_SAD_SetSignalToNoiseThreshold() to set signal to noise threshold on a specified sound
    activity detector.
  - Call the function HAL_ADF_SAD_GetSignalToNoiseThreshold() to get current signal to noise threshold on a specified
    sound activity detector.
  - Call the function HAL_ADF_SAD_SetAmbientNoiseSlope() to set ambient noise slope on a specified sound activity
    detector.
  - Call the function HAL_ADF_SAD_GetAmbientNoiseSlope() to get current ambient noise slope on a specified sound
    activity detector.
  - Call the function HAL_ADF_SAD_SetHangoverTimeWindow() to set hangover time window on a specified sound activity
    detector.
  - Call the function HAL_ADF_SAD_GetHangoverTimeWindow() to get current hangover time window on a specified sound
    activity detector.

This section provides also a set of functions allowing to control sound activity detector:
  - Call the function HAL_ADF_SAD_EnableHysteresis() to enable hysteresis on a specified sound activity detector.
  - Call the function HAL_ADF_SAD_DisableHysteresis() to disable hysteresis on a specified sound activity detector.
  - Call the function HAL_ADF_SAD_IsEnabledHysteresis() to check hysteresis status on a specified sound activity
    detector.

This section provides also a set of functions allowing to process sound activity detector:
  - Call the function HAL_ADF_SAD_Start() to activate a specified sound activity detector in polling mode.
  - Call the function HAL_ADF_SAD_Stop() to deactivate a specified sound activity detector in polling mode.
  - Call the function HAL_ADF_SAD_IsDetected() to check detection status on a specified sound activity detector in
    polling mode.
  - Call the function HAL_ADF_SAD_PollForSoundLevel() to wait available sound level on a specified sound activity
    detector in polling mode.
  - Call the function HAL_ADF_SAD_GetSoundAndAmbientNoiseLevels() to get current sound level and ambient noise level on
    a specified sound activity detector.
  - Call the function HAL_ADF_SAD_Start_IT() to activate a specified sound activity detector in interrupt mode.
  - Call the function HAL_ADF_SAD_Stop_IT() to deactivate a specified sound activity detector in interrupt mode.
  - Call the function HAL_ADF_SAD_Start_IT_Opt() to activate a specified sound activity detector in interrupt mode with
    optional interruptions.
  */

