STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.c
/* Configuration functions */
/**
  * @brief  Configure a specified sound activity detector.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @param  p_config                      Pointer to sound activity detector configuration structure.
  * @retval HAL_OK                        Operation completed successfully.
  * @retval HAL_INVALID_PARAM             Pointer to sound activity detector configuration structure is NULL.
  */
hal_status_t HAL_ADF_SAD_SetConfig(hal_adf_handle_t *hadf,
                                   hal_adf_block_index_t sound_activity_detector_index,
                                   const hal_adf_sad_config_t *p_config)
{
  ADF_Block_TypeDef *p_adf_block;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));
  ASSERT_DBG_PARAM(p_config != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_ADF_SAD_MODE(p_config->mode));
  ASSERT_DBG_PARAM(IS_ADF_SAD_MEMORY_TRANSFER(p_config->memory_transfer));
  ASSERT_DBG_PARAM(IS_ADF_SAD_TRIGGER_EVENT(p_config->trigger_event));
  ASSERT_DBG_PARAM(IS_ADF_SAD_MINIMUM_AMBIENT_NOISE(p_config->minimum_ambient_noise));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index],
                   (uint32_t)HAL_ADF_SAD_STATE_RESET | (uint32_t)HAL_ADF_SAD_STATE_IDLE);

  p_adf_block = ADF_GET_BLOCK(hadf, sound_activity_detector_index);
  MODIFY_REG(p_adf_block->SADCR, ADF_SADCR_DATCAP_Msk | ADF_SADCR_DETCFG_Msk | ADF_SADCR_SADMOD_Msk,
             (uint32_t)p_config->memory_transfer | (uint32_t)p_config->trigger_event | (uint32_t)p_config->mode);
  MODIFY_REG(p_adf_block->SADCFGR, ADF_SADCFGR_ANMIN_Msk, p_config->minimum_ambient_noise << ADF_SADCFGR_ANMIN_Pos);

  hadf->sound_activity_detector_states[sound_activity_detector_index] = HAL_ADF_SAD_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief Get the current configuration of a specified sound activity detector.
  * @param hadf                          Pointer to a hal_adf_handle_t.
  * @param sound_activity_detector_index Sound activity detector index.
  * @param p_config                      Pointer to sound activity detector configuration structure.
  */
void HAL_ADF_SAD_GetConfig(const hal_adf_handle_t *hadf,
                           hal_adf_block_index_t sound_activity_detector_index,
                           hal_adf_sad_config_t *p_config)
{
  const ADF_Block_TypeDef *p_adf_block;
  uint32_t reg;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));
  ASSERT_DBG_PARAM(p_config != NULL);

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index],
                   (uint32_t)HAL_ADF_SAD_STATE_IDLE | (uint32_t)HAL_ADF_SAD_STATE_ACTIVE);

  p_adf_block = ADF_GET_BLOCK(hadf, sound_activity_detector_index);
  reg = READ_REG(p_adf_block->SADCR);
  p_config->mode = (hal_adf_sad_mode_t)(uint32_t)(reg & ADF_SADCR_SADMOD_Msk);
  p_config->memory_transfer = (hal_adf_sad_memory_transfer_t)(uint32_t)(reg & ADF_SADCR_DATCAP_Msk);
  p_config->trigger_event = (hal_adf_sad_trigger_event_t)(uint32_t)(reg & ADF_SADCR_DETCFG_Msk);
  reg = READ_REG(p_adf_block->SADCFGR);
  p_config->minimum_ambient_noise = (reg & ADF_SADCFGR_ANMIN_Msk) >> ADF_SADCFGR_ANMIN_Pos;
}

/**
  * @brief  Set frame size on a specified sound activity detector.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @param  frame_size                    Frame size.
  * @retval HAL_OK                        Operation completed successfully.
  */
hal_status_t HAL_ADF_SAD_SetFrameSize(const hal_adf_handle_t *hadf,
                                      hal_adf_block_index_t sound_activity_detector_index,
                                      hal_adf_sad_frame_size_t frame_size)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));
  ASSERT_DBG_PARAM(IS_ADF_SAD_FRAME_SIZE(frame_size));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index], HAL_ADF_SAD_STATE_IDLE);

  MODIFY_REG(ADF_GET_BLOCK(hadf, sound_activity_detector_index)->SADCR, ADF_SADCR_FRSIZE_Msk, (uint32_t)frame_size);

  return HAL_OK;
}

/**
  * @brief  Get current frame size on a specified sound activity detector.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @retval hal_adf_sad_frame_size_t      Frame size.
  */
hal_adf_sad_frame_size_t HAL_ADF_SAD_GetFrameSize(const hal_adf_handle_t *hadf,
                                                  hal_adf_block_index_t sound_activity_detector_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index],
                   (uint32_t)HAL_ADF_SAD_STATE_IDLE | (uint32_t)HAL_ADF_SAD_STATE_ACTIVE);

  return (hal_adf_sad_frame_size_t)(uint32_t)READ_BIT(ADF_GET_BLOCK(hadf, sound_activity_detector_index)->SADCR,
                                                      ADF_SADCR_FRSIZE_Msk);
}

/**
  * @brief  Set learning frames on a specified sound activity detector.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @param  learning_frames               Learning frames.
  * @retval HAL_OK                        Operation completed successfully.
  */
hal_status_t HAL_ADF_SAD_SetLearningFrames(const hal_adf_handle_t *hadf,
                                           hal_adf_block_index_t sound_activity_detector_index,
                                           hal_adf_sad_learning_frames_t learning_frames)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));
  ASSERT_DBG_PARAM(IS_ADF_SAD_LEARNING_FRAMES(learning_frames));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index], HAL_ADF_SAD_STATE_IDLE);

  MODIFY_REG(ADF_GET_BLOCK(hadf, sound_activity_detector_index)->SADCFGR, ADF_SADCFGR_LFRNB_Msk,
             (uint32_t)learning_frames);

  return HAL_OK;
}

/**
  * @brief  Get learning frames on a specified sound activity detector.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @retval hal_adf_sad_learning_frames_t Learning frames.
  */
hal_adf_sad_learning_frames_t HAL_ADF_SAD_GetLearningFrames(const hal_adf_handle_t *hadf,
                                                            hal_adf_block_index_t sound_activity_detector_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index],
                   (uint32_t)HAL_ADF_SAD_STATE_IDLE | (uint32_t)HAL_ADF_SAD_STATE_ACTIVE);

