STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.c
  return (hal_adf_sad_learning_frames_t)(uint32_t)READ_BIT(ADF_GET_BLOCK(hadf, sound_activity_detector_index)->SADCFGR,
                                                           ADF_SADCFGR_LFRNB_Msk);
}

/**
  * @brief  Set signal to noise threshold on a specified sound activity detector.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @param  threshold                     Signal to noise threshold.
  * @retval HAL_OK                        Operation completed successfully.
  */
hal_status_t HAL_ADF_SAD_SetSignalToNoiseThreshold(const hal_adf_handle_t *hadf,
                                                   hal_adf_block_index_t sound_activity_detector_index,
                                                   hal_adf_sad_signal_to_noise_threshold_t threshold)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));
  ASSERT_DBG_PARAM(IS_ADF_SAD_SIGNAL_TO_NOISE_THRESHOLD(threshold));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index], HAL_ADF_SAD_STATE_IDLE);

  MODIFY_REG(ADF_GET_BLOCK(hadf, sound_activity_detector_index)->SADCFGR, ADF_SADCFGR_SNTHR_Msk,
             (uint32_t)threshold);

  return HAL_OK;
}

/**
  * @brief  Get signal to noise threshold on a specified sound activity detector.
  * @param  hadf                                    Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index           Sound activity detector index.
  * @retval hal_adf_sad_signal_to_noise_threshold_t Signal to noise threshold.
  */
hal_adf_sad_signal_to_noise_threshold_t HAL_ADF_SAD_GetSignalToNoiseThreshold(
  const hal_adf_handle_t *hadf,
  hal_adf_block_index_t sound_activity_detector_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index],
                   (uint32_t)HAL_ADF_SAD_STATE_IDLE | (uint32_t)HAL_ADF_SAD_STATE_ACTIVE);

  return (hal_adf_sad_signal_to_noise_threshold_t)(uint32_t)READ_BIT(
           ADF_GET_BLOCK(hadf, sound_activity_detector_index)->SADCFGR, ADF_SADCFGR_SNTHR_Msk);
}

/**
  * @brief  Set ambient noise slope on a specified sound activity detector.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @param  ambient_noise_slope           Ambient noise slope.
  *                                       This parameter must be a number between Min_Data = 0 and Max_Data = 7.
  * @retval HAL_OK                        Operation completed successfully.
  */
hal_status_t HAL_ADF_SAD_SetAmbientNoiseSlope(const hal_adf_handle_t *hadf,
                                              hal_adf_block_index_t sound_activity_detector_index,
                                              uint32_t ambient_noise_slope)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));
  ASSERT_DBG_PARAM(IS_ADF_SAD_AMBIENT_NOISE_SLOPE(ambient_noise_slope));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index], HAL_ADF_SAD_STATE_IDLE);

  MODIFY_REG(ADF_GET_BLOCK(hadf, sound_activity_detector_index)->SADCFGR, ADF_SADCFGR_ANSLP_Msk,
             ambient_noise_slope << ADF_SADCFGR_ANSLP_Pos);

  return HAL_OK;
}

/**
  * @brief  Get ambient noise slope on a specified sound activity detector.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @retval uint32_t                      Ambient noise slope.
  */
uint32_t HAL_ADF_SAD_GetAmbientNoiseSlope(const hal_adf_handle_t *hadf,
                                          hal_adf_block_index_t sound_activity_detector_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index],
                   (uint32_t)HAL_ADF_SAD_STATE_IDLE | (uint32_t)HAL_ADF_SAD_STATE_ACTIVE);

  return (READ_BIT(ADF_GET_BLOCK(hadf, sound_activity_detector_index)->SADCFGR, ADF_SADCFGR_ANSLP_Msk)
          >> ADF_SADCFGR_ANSLP_Pos);
}

/**
  * @brief  Set hangover time window on a specified sound activity detector.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @param  hangover_time_window          Hangover time window.
  * @retval HAL_OK                        Operation completed successfully.
  */
hal_status_t HAL_ADF_SAD_SetHangoverTimeWindow(const hal_adf_handle_t *hadf,
                                               hal_adf_block_index_t sound_activity_detector_index,
                                               hal_adf_sad_hangover_time_window_t hangover_time_window)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));
  ASSERT_DBG_PARAM(IS_ADF_SAD_HANGOVER_TIME_WINDOW(hangover_time_window));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index], HAL_ADF_SAD_STATE_IDLE);

  MODIFY_REG(ADF_GET_BLOCK(hadf, sound_activity_detector_index)->SADCFGR, ADF_SADCFGR_HGOVR_Msk,
             (uint32_t)hangover_time_window);

  return HAL_OK;
}

/**
  * @brief  Get hangover time window on a specified sound activity detector.
  * @param  hadf                               Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index      Sound activity detector index.
  * @retval hal_adf_sad_hangover_time_window_t Hangover time window.
  */
hal_adf_sad_hangover_time_window_t HAL_ADF_SAD_GetHangoverTimeWindow(
  const hal_adf_handle_t *hadf,
  hal_adf_block_index_t sound_activity_detector_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index],
                   (uint32_t)HAL_ADF_SAD_STATE_IDLE | (uint32_t)HAL_ADF_SAD_STATE_ACTIVE);

  return (hal_adf_sad_hangover_time_window_t)(uint32_t)READ_BIT(
           ADF_GET_BLOCK(hadf, sound_activity_detector_index)->SADCFGR, ADF_SADCFGR_HGOVR_Msk);
}

/* Control functions */
/**
  * @brief  Enable hysteresis on a specified sound activity detector.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @retval HAL_OK                        Operation completed successfully.
  */
hal_status_t HAL_ADF_SAD_EnableHysteresis(const hal_adf_handle_t *hadf,
                                          hal_adf_block_index_t sound_activity_detector_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index], HAL_ADF_SAD_STATE_IDLE);

  SET_BIT(ADF_GET_BLOCK(hadf, sound_activity_detector_index)->SADCR, ADF_SADCR_HYSTEN);

  return HAL_OK;
}

/**
  * @brief  Disable hysteresis on a specified sound activity detector.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @retval HAL_OK                        Operation completed successfully.
  */
hal_status_t HAL_ADF_SAD_DisableHysteresis(const hal_adf_handle_t *hadf,
                                           hal_adf_block_index_t sound_activity_detector_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index], HAL_ADF_SAD_STATE_IDLE);

  CLEAR_BIT(ADF_GET_BLOCK(hadf, sound_activity_detector_index)->SADCR, ADF_SADCR_HYSTEN);

  return HAL_OK;
}

/**
  * @brief  Check hysteresis status on a specified sound activity detector.
  * @param  hadf                            Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index   Sound activity detector index.
  * @retval hal_adf_sad_hysteresis_status_t Hysteresis status.
  */
hal_adf_sad_hysteresis_status_t HAL_ADF_SAD_IsEnabledHysteresis(const hal_adf_handle_t *hadf,
                                                                hal_adf_block_index_t sound_activity_detector_index)
{
  hal_adf_sad_hysteresis_status_t status;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index],
                   (uint32_t)HAL_ADF_SAD_STATE_IDLE | (uint32_t)HAL_ADF_SAD_STATE_ACTIVE);

