STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.c
  status = (IS_BIT_SET(ADF_GET_BLOCK(hadf, sound_activity_detector_index)->SADCR, ADF_SADCR_HYSTEN))
           ? HAL_ADF_SAD_HYSTERESIS_ENABLED : HAL_ADF_SAD_HYSTERESIS_DISABLED;

  return status;
}

/* Process functions */
/**
  * @brief  Activate a specified sound activity detector in polling mode.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @retval HAL_OK                        Operation completed successfully.
  * @retval HAL_BUSY                      The sound activity detector state is not HAL_ADF_SAD_STATE_IDLE
  *                                       (USE_HAL_CHECK_PROCESS_STATE is set to 1).
  */
hal_status_t HAL_ADF_SAD_Start(hal_adf_handle_t *hadf,
                               hal_adf_block_index_t sound_activity_detector_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[sound_activity_detector_index], HAL_ADF_DFLT_STATE_IDLE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index], HAL_ADF_SAD_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hadf, sound_activity_detector_states[sound_activity_detector_index], HAL_ADF_SAD_STATE_IDLE,
                         HAL_ADF_SAD_STATE_ACTIVE);

  SET_BIT(ADF_GET_BLOCK(hadf, sound_activity_detector_index)->SADCR, ADF_SADCR_SADEN);

  return HAL_OK;
}

/**
  * @brief  Deactivate a specified sound activity detector in polling mode.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @retval HAL_OK                        Operation completed successfully.
  */
hal_status_t HAL_ADF_SAD_Stop(hal_adf_handle_t *hadf,
                              hal_adf_block_index_t sound_activity_detector_index)
{
  ADF_Block_TypeDef *p_adf_block;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index], HAL_ADF_SAD_STATE_ACTIVE);

  /* Deactivate sound activity detector and clear potential pending flags */
  p_adf_block = ADF_GET_BLOCK(hadf, sound_activity_detector_index);
  CLEAR_BIT(p_adf_block->SADCR, ADF_SADCR_SADEN);
  WRITE_REG(p_adf_block->DFLTISR, (ADF_DFLTISR_SDDETF | ADF_DFLTISR_SDLVLF));

  hadf->sound_activity_detector_states[sound_activity_detector_index] = HAL_ADF_SAD_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Check detection status on a specified sound activity detector.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @retval hal_adf_sad_status_t          Sound activity detection status.
  */
hal_adf_sad_status_t HAL_ADF_SAD_IsDetected(const hal_adf_handle_t *hadf,
                                            hal_adf_block_index_t sound_activity_detector_index)
{
  hal_adf_sad_status_t status;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index], HAL_ADF_SAD_STATE_ACTIVE);

  status = (IS_BIT_SET(ADF_GET_BLOCK(hadf, sound_activity_detector_index)->DFLTISR, ADF_DFLTISR_SDDETF))
           ? HAL_ADF_SOUND_ACTIVITY_DETECTED : HAL_ADF_SOUND_ACTIVITY_NOT_DETECTED;

  return status;
}

/**
  * @brief  Wait available sound level on a specified sound activity detector in polling mode.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @param  timeout_ms                    Timeout value.
  * @retval HAL_OK                        Operation completed successfully.
  * @retval HAL_TIMEOUT                   Operation exceeds user timeout.
  */
hal_status_t HAL_ADF_SAD_PollForSoundLevel(hal_adf_handle_t *hadf,
                                           hal_adf_block_index_t sound_activity_detector_index,
                                           uint32_t timeout_ms)
{
  ADF_Block_TypeDef *p_adf_block;
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index], HAL_ADF_SAD_STATE_ACTIVE);

  tickstart = HAL_GetTick();

  /* Check if a sound level is available */
  p_adf_block = ADF_GET_BLOCK(hadf, sound_activity_detector_index);
  while (IS_BIT_CLR(p_adf_block->DFLTISR, ADF_DFLTISR_SDLVLF))
  {
    /* Check for the timeout */
    if (timeout_ms != HAL_MAX_DELAY)
    {
      if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
      {
        return HAL_TIMEOUT;
      }
    }
  }

  return HAL_OK;
}

/**
  * @brief Get sound level and ambient noise level on a specified sound activity detector.
  * @param hadf                          Pointer to a hal_adf_handle_t.
  * @param sound_activity_detector_index Sound activity detector index.
  * @param p_sound_level                 Pointer on sound level value.
  * @param p_ambient_noise_level         Pointer on ambient noise level value.
  */
void HAL_ADF_SAD_GetSoundAndAmbientNoiseLevels(const hal_adf_handle_t *hadf,
                                               hal_adf_block_index_t sound_activity_detector_index,
                                               uint32_t *p_sound_level,
                                               uint32_t *p_ambient_noise_level)
{
  ADF_Block_TypeDef *p_adf_block;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));
  ASSERT_DBG_PARAM(p_sound_level != NULL);
  ASSERT_DBG_PARAM(p_ambient_noise_level != NULL);

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index],
                   (uint32_t)HAL_ADF_SAD_STATE_IDLE | (uint32_t)HAL_ADF_SAD_STATE_ACTIVE);

