STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.c
  p_adf_block = ADF_GET_BLOCK(hadf, sound_activity_detector_index);
  *p_sound_level = READ_BIT(p_adf_block->SADSDLVR, ADF_SADSDLVR_SDLVL_Msk);
  *p_ambient_noise_level = READ_BIT(p_adf_block->SADANLVR, ADF_SADANLVR_ANLVL_Msk);
  WRITE_REG(p_adf_block->DFLTISR, ADF_DFLTISR_SDLVLF);
}

/**
  * @brief  Activate a specified sound activity detector in interrupt mode.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @retval HAL_OK                        Operation completed successfully.
  * @retval HAL_BUSY                      The sound activity detector state is not HAL_ADF_SAD_STATE_IDLE
  *                                       (USE_HAL_CHECK_PROCESS_STATE is set to 1).
  */
hal_status_t HAL_ADF_SAD_Start_IT(hal_adf_handle_t *hadf,
                                  hal_adf_block_index_t sound_activity_detector_index)
{
  ADF_Block_TypeDef *p_adf_block;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[sound_activity_detector_index], HAL_ADF_DFLT_STATE_IDLE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index], HAL_ADF_SAD_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hadf, sound_activity_detector_states[sound_activity_detector_index], HAL_ADF_SAD_STATE_IDLE,
                         HAL_ADF_SAD_STATE_ACTIVE);

  /* Enable all sound activity detector interruptions */
  p_adf_block = ADF_GET_BLOCK(hadf, sound_activity_detector_index);
  SET_BIT(p_adf_block->DFLTIER, ADF_DFLTIER_SDDETIE | ADF_DFLTIER_SDLVLIE);

  /* Activate sound activity detector */
  SET_BIT(p_adf_block->SADCR, ADF_SADCR_SADEN);

  return HAL_OK;
}

/**
  * @brief  Deactivate a specified sound activity detector in interrupt mode.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @retval HAL_OK                        Operation completed successfully.
  */
hal_status_t HAL_ADF_SAD_Stop_IT(hal_adf_handle_t *hadf,
                                 hal_adf_block_index_t sound_activity_detector_index)
{
  ADF_Block_TypeDef *p_adf_block;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index], HAL_ADF_SAD_STATE_ACTIVE);

  /* Deactivate sound activity detector */
  p_adf_block = ADF_GET_BLOCK(hadf, sound_activity_detector_index);
  CLEAR_BIT(p_adf_block->SADCR, ADF_SADCR_SADEN);

  /* Disable all sound activity detector interruptions */
  CLEAR_BIT(p_adf_block->DFLTIER, ADF_DFLTIER_SDDETIE | ADF_DFLTIER_SDLVLIE);

  /* Clear potential pending flags */
  WRITE_REG(p_adf_block->DFLTISR, ADF_DFLTISR_SDDETF | ADF_DFLTISR_SDLVLF);

  hadf->sound_activity_detector_states[sound_activity_detector_index] = HAL_ADF_SAD_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Activate a specified sound activity detector in interrupt mode with optional interruptions.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @param  interruptions                 Optional interruptions.
  *                                       This parameter must be one of the following values:
  *                                         @arg @ref HAL_ADF_SAD_OPT_IT_NONE
  *                                         @arg @ref HAL_ADF_SAD_OPT_IT_SOUND_LEVEL
  *                                         @arg @ref HAL_ADF_SAD_OPT_IT_DEFAULT
  * @retval HAL_OK                        Operation completed successfully.
  * @retval HAL_BUSY                      The sound activity detector state is not HAL_ADF_SAD_STATE_IDLE
  *                                       (USE_HAL_CHECK_PROCESS_STATE is set to 1).
  */
hal_status_t HAL_ADF_SAD_Start_IT_Opt(hal_adf_handle_t *hadf,
                                      hal_adf_block_index_t sound_activity_detector_index,
                                      uint32_t interruptions)
{
  ADF_Block_TypeDef *p_adf_block;
  uint32_t it_enable;

  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));
  ASSERT_DBG_PARAM(IS_ADF_SAD_OPTIONAL_IT(interruptions));

  ASSERT_DBG_STATE(hadf->global_state, HAL_ADF_STATE_ACTIVE);
  ASSERT_DBG_STATE(hadf->digital_filter_states[sound_activity_detector_index], HAL_ADF_DFLT_STATE_IDLE);
  ASSERT_DBG_STATE(hadf->sound_activity_detector_states[sound_activity_detector_index], HAL_ADF_SAD_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hadf, sound_activity_detector_states[sound_activity_detector_index], HAL_ADF_SAD_STATE_IDLE,
                         HAL_ADF_SAD_STATE_ACTIVE);

  /* Enable sound activity detection and optional interruptions */
  p_adf_block = ADF_GET_BLOCK(hadf, sound_activity_detector_index);
  it_enable = ADF_DFLTIER_SDDETIE;
  if ((interruptions & HAL_ADF_SAD_OPT_IT_SOUND_LEVEL) == HAL_ADF_SAD_OPT_IT_SOUND_LEVEL)
  {
    it_enable |= ADF_DFLTIER_SDLVLIE;
  }
  SET_BIT(p_adf_block->DFLTIER, it_enable);

  /* Activate sound activity detector */
  SET_BIT(p_adf_block->SADCR, ADF_SADCR_SADEN);

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup ADF_Exported_Functions_Group7
  * @{
This section provides function allowing to handle the ADF interrupt request on blocks, HAL_ADF_IRQHandler().

This section provides also a set of functions allowing to handle callbacks:
  - HAL_ADF_DFLT_AcqCpltCallback() is called when acquisition complete occurs on a specified digital filter.
  - HAL_ADF_DFLT_AcqHalfCpltCallback() is called when acquisition half complete occurs on a specified digital filter.
  - HAL_ADF_DFLT_AcqStopCpltCallback() is called when acquisition stop complete occurs on a specified digital filter.
  - HAL_ADF_SAD_SoundLevelCallback() is called when sound level ready occurs on a specified sound activity detector.
  - HAL_ADF_SAD_SoundActivityCallback() is called when sound detection occurs on a specified sound activity detector.
  - HAL_ADF_ErrorCallback() is called when an error occurs on a specified block.

