STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.c
This section provides also a set of functions allowing to register callbacks:
  - Call the function HAL_ADF_DFLT_RegisterAcqCpltCallback() to register acquisition complete callback.
  - Call the function HAL_ADF_DFLT_RegisterAcqHalfCpltCallback() to register acquisition half complete callback.
  - Call the function HAL_ADF_DFLT_RegisterAcqStopCpltCallback() to register acquisition stop complete callback.
  - Call the function HAL_ADF_SAD_RegisterSoundLevelCallback() to register sound level callback.
  - Call the function HAL_ADF_SAD_RegisterSoundActivityCallback() to register sound activity callback.
  - Call the function HAL_ADF_RegisterErrorCallback() to register error callback.
  */

/**
  * @brief Handle the ADF interrupt request on a specified block.
  * @param hadf        Pointer to a hal_adf_handle_t.
  * @param block_index Block index.
  */
void HAL_ADF_IRQHandler(hal_adf_handle_t *hadf, hal_adf_block_index_t block_index)
{
  ADF_Block_TypeDef *p_adf_block;
  uint32_t interruptions;
  uint32_t flags;
  uint32_t error = 0U;

  p_adf_block = ADF_GET_BLOCK(hadf, block_index);
  interruptions = READ_REG(p_adf_block->DFLTIER);
  flags = READ_REG(p_adf_block->DFLTISR);
  interruptions &= flags;

  /* RXFIFO threshold interruption occurrence */
  if (IS_BIT_SET(interruptions, ADF_DFLTISR_FTHF))
  {
    /* If acquisition mode is asynchronous single shot, set digital filter state to idle */
    if (READ_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_ACQMOD_Msk) == (uint32_t)HAL_ADF_DFLT_ACQ_MODE_ASYNC_SINGLE)
    {
      /* Deactivate digital filter, disable acquisition interruptions and clear potential pending flags */
      CLEAR_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DFLTEN);
      CLEAR_BIT(p_adf_block->DFLTIER, ADF_DFLTIER_FTHIE | ADF_DFLTIER_DOVRIE | ADF_DFLTIER_SATIE | ADF_DFLTIER_RFOVRIE);
      WRITE_REG(p_adf_block->DFLTISR, ADF_DFLTISR_DOVRF | ADF_DFLTISR_SATF | ADF_DFLTISR_RFOVRF);

      hadf->digital_filter_states[block_index] = HAL_ADF_DFLT_STATE_IDLE;
    }

#if defined(USE_HAL_ADF_REGISTER_CALLBACKS) && (USE_HAL_ADF_REGISTER_CALLBACKS == 1)
    hadf->p_acquisition_cplt_cb(hadf, block_index);
#else
    HAL_ADF_DFLT_AcqCpltCallback(hadf, block_index);
#endif /* USE_HAL_ADF_REGISTER_CALLBACKS */
  }

  /* Sound activity detection interruption occurrence */
  if (IS_BIT_SET(interruptions, ADF_DFLTISR_SDDETF))
  {
    /* Clear sound activity detection flag */
    SET_BIT(p_adf_block->DFLTISR, ADF_DFLTISR_SDDETF);

#if defined(USE_HAL_ADF_REGISTER_CALLBACKS) && (USE_HAL_ADF_REGISTER_CALLBACKS == 1)
    hadf->p_sound_activity_cb(hadf, block_index);
#else
    HAL_ADF_SAD_SoundActivityCallback(hadf, block_index);
#endif /* USE_HAL_ADF_REGISTER_CALLBACKS */
  }

  /* Sound level ready interruption occurrence */
  if (IS_BIT_SET(interruptions, ADF_DFLTISR_SDLVLF))
  {
    /* Clear sound level ready flag */
    SET_BIT(p_adf_block->DFLTISR, ADF_DFLTISR_SDLVLF);

#if defined(USE_HAL_ADF_REGISTER_CALLBACKS) && (USE_HAL_ADF_REGISTER_CALLBACKS == 1)
    hadf->p_sound_level_cb(hadf, block_index);
#else
    HAL_ADF_SAD_SoundLevelCallback(hadf, block_index);
#endif /* USE_HAL_ADF_REGISTER_CALLBACKS */
  }

  /* Data overflow interruption occurrence */
  if (IS_BIT_SET(interruptions, ADF_DFLTISR_DOVRF))
  {
#if defined(USE_HAL_ADF_GET_LAST_ERRORS) && (USE_HAL_ADF_GET_LAST_ERRORS == 1)
    hadf->last_error_codes[block_index] |= HAL_ADF_ERROR_DFLT_ACQ_OVERFLOW;
#endif /* USE_HAL_ADF_GET_LAST_ERRORS */

    /* Clear data overflow flag */
    SET_BIT(p_adf_block->DFLTISR, ADF_DFLTISR_DOVRF);

    error = 1U;
  }

  /* Saturation interruption occurrence */
  if (IS_BIT_SET(interruptions, ADF_DFLTISR_SATF))
  {
#if defined(USE_HAL_ADF_GET_LAST_ERRORS) && (USE_HAL_ADF_GET_LAST_ERRORS == 1)
    hadf->last_error_codes[block_index] |= HAL_ADF_ERROR_DFLT_SATURATION;
#endif /* USE_HAL_ADF_GET_LAST_ERRORS */

    /* Clear saturation flag */
    SET_BIT(p_adf_block->DFLTISR, ADF_DFLTISR_SATF);

    error = 1U;
  }

  /* Reshape filter overrun interruption occurrence */
  if (IS_BIT_SET(interruptions, ADF_DFLTISR_RFOVRF))
  {
#if defined(USE_HAL_ADF_GET_LAST_ERRORS) && (USE_HAL_ADF_GET_LAST_ERRORS == 1)
    hadf->last_error_codes[block_index] |= HAL_ADF_ERROR_DFLT_RSF_OVERRUN;
#endif /* USE_HAL_ADF_GET_LAST_ERRORS */

    /* Clear reshape filter overrun flag */
    SET_BIT(p_adf_block->DFLTISR, ADF_DFLTISR_RFOVRF);

    error = 1U;
  }

  /* Clock absence detection interruption occurrence */
  if (IS_BIT_SET(interruptions, ADF_DFLTISR_CKABF))
  {
#if defined(USE_HAL_ADF_GET_LAST_ERRORS) && (USE_HAL_ADF_GET_LAST_ERRORS == 1)
    hadf->last_error_codes[block_index] |= HAL_ADF_ERROR_SITF_CLOCK_ABSENCE;
#endif /* USE_HAL_ADF_GET_LAST_ERRORS */

    /* Clear clock absence detection flag */
    SET_BIT(p_adf_block->DFLTISR, ADF_DFLTISR_CKABF);

    error = 1U;
  }

  if (error == 1U)
  {
#if defined(USE_HAL_ADF_REGISTER_CALLBACKS) && (USE_HAL_ADF_REGISTER_CALLBACKS == 1)
    hadf->p_error_cb(hadf, block_index);
#else
    HAL_ADF_ErrorCallback(hadf, block_index);
#endif /* USE_HAL_ADF_REGISTER_CALLBACKS */
  }
}

/**
  * @brief   Acquisition complete callback.
  * @param   hadf                 Pointer to a hal_adf_handle_t.
  * @param   digital_filter_index Digital filter index.
  * @warning This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_ADF_DFLT_AcqCpltCallback(hal_adf_handle_t *hadf, hal_adf_block_index_t digital_filter_index)
{
  STM32_UNUSED(hadf);
  STM32_UNUSED(digital_filter_index);
}

/**
  * @brief   Acquisition half complete callback.
  * @param   hadf                 Pointer to a hal_adf_handle_t.
  * @param   digital_filter_index Digital filter index.
  * @warning This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_ADF_DFLT_AcqHalfCpltCallback(hal_adf_handle_t *hadf, hal_adf_block_index_t digital_filter_index)
{
  STM32_UNUSED(hadf);
  STM32_UNUSED(digital_filter_index);
}

/**
  * @brief   Acquisition stop callback.
  * @param   hadf                 Pointer to a hal_adf_handle_t.
  * @param   digital_filter_index Digital filter index.
  * @warning This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_ADF_DFLT_AcqStopCpltCallback(hal_adf_handle_t *hadf, hal_adf_block_index_t digital_filter_index)
{
  STM32_UNUSED(hadf);
  STM32_UNUSED(digital_filter_index);
}

/**
  * @brief   Sound level callback.
  * @param   hadf                          Pointer to a hal_adf_handle_t.
  * @param   sound_activity_detector_index Sound activity detector index.
  * @warning This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_ADF_SAD_SoundLevelCallback(hal_adf_handle_t *hadf, hal_adf_block_index_t sound_activity_detector_index)
{
  STM32_UNUSED(hadf);
  STM32_UNUSED(sound_activity_detector_index);
}

/**
  * @brief   Sound activity callback.
  * @param   hadf                          Pointer to a hal_adf_handle_t.
  * @param   sound_activity_detector_index Sound activity detector index.
  * @warning This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_ADF_SAD_SoundActivityCallback(hal_adf_handle_t *hadf,
                                              hal_adf_block_index_t sound_activity_detector_index)
{
  STM32_UNUSED(hadf);
  STM32_UNUSED(sound_activity_detector_index);
}

/**
  * @brief   Error callback.
  * @param   hadf        Pointer to a hal_adf_handle_t.
  * @param   block_index Block index.
  * @warning This weak function must not be modified. When the callback is needed, it is overridden in the user file.
  */
__WEAK void HAL_ADF_ErrorCallback(hal_adf_handle_t *hadf, hal_adf_block_index_t block_index)
{
  STM32_UNUSED(hadf);
  STM32_UNUSED(block_index);
}

#if defined(USE_HAL_ADF_REGISTER_CALLBACKS) && (USE_HAL_ADF_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a user acquisition complete callback.
  * @param  hadf              Pointer to a hal_adf_handle_t.
  * @param  p_callback        Pointer to the callback function.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM Pointer to the callback function is NULL.
  */
hal_status_t HAL_ADF_DFLT_RegisterAcqCpltCallback(hal_adf_handle_t *hadf, hal_adf_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hadf->p_acquisition_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a user acquisition half complete callback.
  * @param  hadf              Pointer to a hal_adf_handle_t.
  * @param  p_callback        Pointer to the callback function.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM Pointer to the callback function is NULL.
  */
hal_status_t HAL_ADF_DFLT_RegisterAcqHalfCpltCallback(hal_adf_handle_t *hadf, hal_adf_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hadf->p_acquisition_half_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a user acquisition stop callback.
  * @param  hadf              Pointer to a hal_adf_handle_t.
  * @param  p_callback        Pointer to the callback function.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM Pointer to the callback function is NULL.
  */
hal_status_t HAL_ADF_DFLT_RegisterAcqStopCpltCallback(hal_adf_handle_t *hadf, hal_adf_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hadf->p_acquisition_stop_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a user sound level callback.
  * @param  hadf              Pointer to a hal_adf_handle_t.
  * @param  p_callback        Pointer to the callback function.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM Pointer to the callback function is NULL.
  */
hal_status_t HAL_ADF_SAD_RegisterSoundLevelCallback(hal_adf_handle_t *hadf, hal_adf_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hadf->p_sound_level_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a user sound activity callback.
  * @param  hadf              Pointer to a hal_adf_handle_t.
  * @param  p_callback        Pointer to the callback function.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM Pointer to the callback function is NULL.
  */
hal_status_t HAL_ADF_SAD_RegisterSoundActivityCallback(hal_adf_handle_t *hadf, hal_adf_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hadf->p_sound_activity_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register a user error callback.
  * @param  hadf              Pointer to a hal_adf_handle_t.
  * @param  p_callback        Pointer to the callback function.
  * @retval HAL_OK            Operation completed successfully.
  * @retval HAL_INVALID_PARAM Pointer to the callback function is NULL.
  */
hal_status_t HAL_ADF_RegisterErrorCallback(hal_adf_handle_t *hadf, hal_adf_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hadf->p_error_cb = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_ADF_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @addtogroup ADF_Exported_Functions_Group8
  * @{
This section provides a set of functions allowing to get all current states:
  - Call the function HAL_ADF_GetState() to get the current global state.
  - Call the function HAL_ADF_SITF_GetState() to get the current state of a specified serial interface.
  - Call the function HAL_ADF_DFLT_GetState() to get the current state of a specified digital filter.
  - Call the function HAL_ADF_SAD_GetState() to get the current state of a specified sound activity detector.
  */

/**
  * @brief  Get the current global state.
  * @param  hadf            Pointer to a hal_adf_handle_t.
  * @retval hal_adf_state_t Global state.
  */
hal_adf_state_t HAL_ADF_GetState(const hal_adf_handle_t *hadf)
{
  ASSERT_DBG_PARAM(hadf != NULL);

  return hadf->global_state;
}

/**
  * @brief  Get the current state of a specified serial interface.
  * @param  hadf                             Pointer to a hal_adf_handle_t.
  * @param  serial_interface_index           Serial interface index.
  * @retval hal_adf_serial_interface_state_t Serial interface state.
  */
hal_adf_serial_interface_state_t HAL_ADF_SITF_GetState(const hal_adf_handle_t *hadf,
                                                       hal_adf_block_index_t serial_interface_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)serial_interface_index));

