STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.c
  return hadf->serial_interface_states[serial_interface_index];
}

/**
  * @brief  Get the current state of a specified digital filter.
  * @param  hadf                           Pointer to a hal_adf_handle_t.
  * @param  digital_filter_index           Digital filter index.
  * @retval hal_adf_digital_filter_state_t Digital filter state.
  */
hal_adf_digital_filter_state_t HAL_ADF_DFLT_GetState(const hal_adf_handle_t *hadf,
                                                     hal_adf_block_index_t digital_filter_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)digital_filter_index));

  return hadf->digital_filter_states[digital_filter_index];
}

/**
  * @brief  Get the current state of a specified sound activity detector.
  * @param  hadf                          Pointer to a hal_adf_handle_t.
  * @param  sound_activity_detector_index Sound activity detector index.
  * @retval hal_adf_sad_state_t           Sound activity detector state.
  */
hal_adf_sad_state_t HAL_ADF_SAD_GetState(const hal_adf_handle_t *hadf,
                                         hal_adf_block_index_t sound_activity_detector_index)
{
  ASSERT_DBG_PARAM(hadf != NULL);
  ASSERT_DBG_PARAM(IS_ADF_BLOCK_INDEX((uint32_t)sound_activity_detector_index));

  return hadf->sound_activity_detector_states[sound_activity_detector_index];
}

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup ADF_Private_Functions
  * @{
  */

/**
  * @brief  Adjust gain to register value.
  * @param  gain    User gain.
  * @retval int32_t Register gain value.
  */
static uint32_t ADF_AdjustGainToRegisterValue(int32_t gain)
{
  uint32_t register_gain;

  if (gain < 0)
  {
    int32_t adjust_gain;

    /* adjust gain value to set on register for negative value (offset of -16) */
    adjust_gain = gain - 16;
    register_gain = ((uint32_t)adjust_gain) & (ADF_DFLTCICR_SCALE_Msk >> ADF_DFLTCICR_SCALE_Pos);
  }
  else
  {
    /* for positive value, no offset to apply */
    register_gain = (uint32_t)gain;
  }

  return register_gain;
}

/**
  * @brief  Adjust gain from register value.
  * @param  register_gain Register gain value.
  * @retval uint32_t      User gain.
  */
static int32_t ADF_AdjustGainFromRegisterValue(uint32_t register_gain)
{
  int32_t gain;

  if (register_gain > 31U)
  {
    /* adjust gain value to set on register for negative value (offset of +16) */
    gain = (int32_t)(uint32_t)(register_gain | ~(ADF_DFLTCICR_SCALE_Msk >> ADF_DFLTCICR_SCALE_Pos)) + 16;
  }
  else
  {
    /* for positive value, no offset to apply */
    gain = (int32_t) register_gain;
  }

  return gain;
}

/**
  * @brief  Enable all acquisition interruptions for a specified digital filter.
  * @param  p_adf_block Pointer to a specified ADF block.
  */
static void ADF_DFLT_EnableInterruptions(ADF_Block_TypeDef *p_adf_block)
{
  uint32_t it_enable;

  it_enable = ADF_DFLTIER_FTHIE | ADF_DFLTIER_DOVRIE | ADF_DFLTIER_SATIE;
  if (IS_BIT_CLR(p_adf_block->DFLTRSFR, ADF_DFLTRSFR_RSFLTBYP))
  {
    it_enable |= ADF_DFLTIER_RFOVRIE;
  }
  MODIFY_REG(p_adf_block->DFLTIER, ADF_DFLTIER_FTHIE_Msk | ADF_DFLTIER_DOVRIE_Msk | ADF_DFLTIER_SATIE_Msk
             | ADF_DFLTIER_RFOVRIE_Msk, it_enable);
}

/**
  * @brief  Enable only acquisition complete and optional interruptions for a specified digital filter.
  * @param  p_adf_block Pointer to ADF block.
  * @param  interruptions Optional interruptions.
  *                       This parameter must be a combination of the following values:
  *                         @arg @ref HAL_ADF_DFLT_OPT_IT_NONE
  *                         @arg @ref HAL_ADF_DFLT_OPT_IT_ACQ_OVR
  *                         @arg @ref HAL_ADF_DFLT_OPT_IT_RSF_OVR
  *                         @arg @ref HAL_ADF_DFLT_OPT_IT_SAT
  *                         @arg @ref HAL_ADF_DFLT_OPT_IT_DEFAULT
  */
static void ADF_DFLT_EnableInterruptions_Opt(ADF_Block_TypeDef *p_adf_block, uint32_t interruptions)
{
  uint32_t it_enable;

  it_enable = ADF_DFLTIER_FTHIE;
  if ((interruptions & HAL_ADF_DFLT_OPT_IT_ACQ_OVR) == HAL_ADF_DFLT_OPT_IT_ACQ_OVR)
  {
    it_enable |= ADF_DFLTIER_DOVRIE;
  }
  if ((interruptions & HAL_ADF_DFLT_OPT_IT_SAT) == HAL_ADF_DFLT_OPT_IT_SAT)
  {
    it_enable |= ADF_DFLTIER_SATIE;
  }
  if ((interruptions & HAL_ADF_DFLT_OPT_IT_RSF_OVR) == HAL_ADF_DFLT_OPT_IT_RSF_OVR)
  {
    it_enable |= ADF_DFLTIER_RFOVRIE;
  }
  MODIFY_REG(p_adf_block->DFLTIER, ADF_DFLTIER_FTHIE_Msk | ADF_DFLTIER_DOVRIE_Msk | ADF_DFLTIER_SATIE_Msk
             | ADF_DFLTIER_RFOVRIE_Msk, it_enable);
}

#if defined (USE_HAL_ADF_DMA) && (USE_HAL_ADF_DMA == 1)
/**
  * @brief  Get block index corresponding to DMA handle on ADF handle.
  * @param  hadf                  Pointer to a hal_adf_handle_t.
  * @param  hdma                  Pointer to a hal_dma_handle_t.
  * @retval hal_adf_block_index_t Digital filter index.
  */
static hal_adf_block_index_t ADF_DFLT_GetBlockIndexFromDmaHandle(const hal_adf_handle_t *hadf,
                                                                 const hal_dma_handle_t *hdma)
{
  uint32_t index = 0U;

#if (ADF1_BLOCKS_NUMBER > 1U)
  while ((hadf->hdma[index] != hdma) && (index < (ADF1_BLOCKS_NUMBER - 1U)))
  {
    index++;
  }
#else
  STM32_UNUSED(hadf);
  STM32_UNUSED(hdma);
#endif /* (ADF1_BLOCKS_NUMBER > 1U) */

  return (hal_adf_block_index_t) index;
}

/**
  * @brief  DMA transfer complete callback.
  * @param  hdma Pointer to a hal_dma_handle_t.
  */
static void ADF_DFLT_DMA_Cplt(hal_dma_handle_t *hdma)
{
  hal_adf_handle_t *hadf = (hal_adf_handle_t *) hdma->p_parent;
  hal_adf_block_index_t digital_filter_index;
  ADF_Block_TypeDef *p_adf_block;

  /* Retrieve digital filter index from DMA handle */
  digital_filter_index = ADF_DFLT_GetBlockIndexFromDmaHandle(hadf, hdma);
  p_adf_block = ADF_GET_BLOCK(hadf, digital_filter_index);

#if defined(USE_HAL_DMA_LINKEDLIST) && (USE_HAL_DMA_LINKEDLIST == 1)
  /* Check if DMA in circular mode*/
  if (hdma->xfer_mode != HAL_DMA_XFER_MODE_LINKEDLIST_CIRCULAR)
#endif /* USE_HAL_DMA_LINKEDLIST */
  {
    /* Deactivate digital filter */
    CLEAR_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DFLTEN);

    /* Disable DMA request */
    CLEAR_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DMAEN);

    /* Disable all acquisition interruptions */
    CLEAR_BIT(p_adf_block->DFLTIER, ADF_DFLTIER_FTHIE | ADF_DFLTIER_DOVRIE | ADF_DFLTIER_SATIE | ADF_DFLTIER_RFOVRIE);

