STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_adf.c
    /* Clear potential pending flags */
    WRITE_REG(p_adf_block->DFLTISR, (ADF_DFLTISR_DOVRF | ADF_DFLTISR_SATF | ADF_DFLTISR_RFOVRF));

    hadf->digital_filter_states[digital_filter_index] = HAL_ADF_DFLT_STATE_IDLE;
  }

#if defined(USE_HAL_ADF_REGISTER_CALLBACKS) && (USE_HAL_ADF_REGISTER_CALLBACKS == 1)
  hadf->p_acquisition_cplt_cb(hadf, digital_filter_index);
#else
  HAL_ADF_DFLT_AcqCpltCallback(hadf, digital_filter_index);
#endif /* USE_HAL_ADF_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA half transfer complete callback.
  * @param  hdma Pointer to a hal_dma_handle_t.
  */
static void ADF_DFLT_DMA_HalfCplt(hal_dma_handle_t *hdma)
{
  hal_adf_handle_t *hadf = (hal_adf_handle_t *) hdma->p_parent;
  hal_adf_block_index_t digital_filter_index;

  /* Retrieve digital filter index from DMA handle */
  digital_filter_index = ADF_DFLT_GetBlockIndexFromDmaHandle(hadf, hdma);

#if defined(USE_HAL_ADF_REGISTER_CALLBACKS) && (USE_HAL_ADF_REGISTER_CALLBACKS == 1)
  hadf->p_acquisition_half_cplt_cb(hadf, digital_filter_index);
#else
  HAL_ADF_DFLT_AcqHalfCpltCallback(hadf, digital_filter_index);
#endif /* USE_HAL_ADF_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA error callback.
  * @param  hdma Pointer to a hal_dma_handle_t.
  */
static void ADF_DFLT_DMA_Error(hal_dma_handle_t *hdma)
{
  hal_adf_handle_t *hadf = (hal_adf_handle_t *) hdma->p_parent;
  hal_adf_block_index_t digital_filter_index;
  ADF_Block_TypeDef *p_adf_block;

  /* Retrieve digital filter index from DMA handle */
  digital_filter_index = ADF_DFLT_GetBlockIndexFromDmaHandle(hadf, hdma);
  p_adf_block = ADF_GET_BLOCK(hadf, digital_filter_index);

#if defined(USE_HAL_ADF_GET_LAST_ERRORS) && (USE_HAL_ADF_GET_LAST_ERRORS == 1)
  hadf->last_error_codes[digital_filter_index] |= HAL_ADF_ERROR_DMA;
#endif /* USE_HAL_ADF_GET_LAST_ERRORS */

  /* Deactivate digital filter */
  CLEAR_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DFLTEN);

  /* Disable DMA request */
  CLEAR_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DMAEN);

  /* Disable all acquisition interruptions */
  CLEAR_BIT(p_adf_block->DFLTIER, ADF_DFLTIER_FTHIE | ADF_DFLTIER_DOVRIE | ADF_DFLTIER_SATIE | ADF_DFLTIER_RFOVRIE);

  /* Clear potential pending flags */
  WRITE_REG(p_adf_block->DFLTISR, (ADF_DFLTISR_DOVRF | ADF_DFLTISR_SATF | ADF_DFLTISR_RFOVRF));

  hadf->digital_filter_states[digital_filter_index] = HAL_ADF_DFLT_STATE_IDLE;

#if defined(USE_HAL_ADF_REGISTER_CALLBACKS) && (USE_HAL_ADF_REGISTER_CALLBACKS == 1)
  hadf->p_error_cb(hadf, digital_filter_index);
#else
  HAL_ADF_ErrorCallback(hadf, digital_filter_index);
#endif /* USE_HAL_ADF_REGISTER_CALLBACKS */
}

/**
  * @brief  DMA abort callback.
  * @param  hdma Pointer to a hal_dma_handle_t.
  */
static void ADF_DFLT_DMA_Abort(hal_dma_handle_t *hdma)
{
  hal_adf_handle_t *hadf = (hal_adf_handle_t *) hdma->p_parent;
  hal_adf_block_index_t digital_filter_index;
  ADF_Block_TypeDef *p_adf_block;

  /* Retrieve digital filter index from DMA handle */
  digital_filter_index = ADF_DFLT_GetBlockIndexFromDmaHandle(hadf, hdma);
  p_adf_block = ADF_GET_BLOCK(hadf, digital_filter_index);

  /* Deactivate digital filter */
  CLEAR_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DFLTEN);

  /* Disable DMA request */
  CLEAR_BIT(p_adf_block->DFLTCR, ADF_DFLTCR_DMAEN);

  /* Disable all acquisition interruptions */
  CLEAR_BIT(p_adf_block->DFLTIER, ADF_DFLTIER_FTHIE | ADF_DFLTIER_DOVRIE | ADF_DFLTIER_SATIE | ADF_DFLTIER_RFOVRIE);

  /* Clear potential pending flags */
  WRITE_REG(p_adf_block->DFLTISR, (ADF_DFLTISR_DOVRF | ADF_DFLTISR_SATF | ADF_DFLTISR_RFOVRF));

  hadf->digital_filter_states[digital_filter_index] = HAL_ADF_DFLT_STATE_IDLE;

#if defined(USE_HAL_ADF_REGISTER_CALLBACKS) && (USE_HAL_ADF_REGISTER_CALLBACKS == 1)
  hadf->p_acquisition_stop_cb(hadf, digital_filter_index);
#else
  HAL_ADF_DFLT_AcqStopCpltCallback(hadf, digital_filter_index);
#endif /* USE_HAL_ADF_REGISTER_CALLBACKS */
}
#endif /* USE_HAL_ADF_DMA */

/**
  * @}
  */

#endif /* USE_HAL_ADF_MODULE */

/**
  * @}
  */

/**
  * @}
  */
